MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/**
  *********************************************************************************************************************
  * @file    stm32c5xx_ll_dma.h
  * @brief   Header file of DMA LL module.
  *********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *********************************************************************************************************************
 @verbatim
  =====================================================================================================================
                      ##### LL DMA driver acronyms #####
  =====================================================================================================================
  [..]  Acronyms table:
                   ======================================
                   | Acronym |                          |
                   ======================================
                   | SRC     |  Source                  |
                   | DEST    |  Destination             |
                   | ADDR    |  Address                 |
                   | INC     |  Increment / Incremented |
                   | DEC     |  Decrement / Decremented |
                   | BLK     |  Block                   |
                   | RPT     |  Repeat / Repeated       |
                   | TRIG    |  Trigger                 |
                   ======================================
 @endverbatim
  *********************************************************************************************************************
  */

/* Define to prevent recursive inclusion ----------------------------------------------------------------------------*/
#ifndef STM32C5XX_LL_DMA_H
#define STM32C5XX_LL_DMA_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ---------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if (defined (LPDMA1) || defined (LPDMA2))

/** @defgroup DMA_LL DMA
  * @{
  */

/* Private types ----------------------------------------------------------------------------------------------------*/
/* Private variables ------------------------------------------------------------------------------------------------*/

/** @defgroup DMA_LL_Private_Variables DMA Private Variables
  * @{
  */
#define LL_DMA_NODE_CTR1_REG_OFFSET          (0U)  /*!< DMA CTR1 register offset          */
#define LL_DMA_NODE_CTR2_REG_OFFSET          (1U)  /*!< DMA CTR2 register offset          */
#define LL_DMA_NODE_CBR1_REG_OFFSET          (2U)  /*!< DMA CBR1 register offset          */
#define LL_DMA_NODE_CSAR_REG_OFFSET          (3U)  /*!< DMA CSAR register offset          */
#define LL_DMA_NODE_CDAR_REG_OFFSET          (4U)  /*!< DMA CDAR register offset          */
#define LL_DMA_NODE_CLLR_REG_OFFSET          (5U)  /*!< DMA CLLR register offset          */

#define LL_DMA_NODE_REGISTER_NUM             (6U)  /*!< DMA node register number          */
#define LL_DMA_NODE_LINEAR_ADDRESSING_OFFSET (20U) /*!< DMA node linear addressing offset */
/**
  * @}
  */

/* Private constants ------------------------------------------------------------------------------------------------*/
/* Private macros ---------------------------------------------------------------------------------------------------*/
/* Exported types ---------------------------------------------------------------------------------------------------*/
/* Exported constants -----------------------------------------------------------------------------------------------*/

/** @defgroup DMA_LL_Exported_Constants LL DMA Constants
  * @{
  */

/** @defgroup DMA_LL_EC_CHANNEL channel
  * @{
  */
#define LL_DMA_CHANNEL_0   0x0001U /*!< LL DMA channel 0   */
#define LL_DMA_CHANNEL_1   0x0002U /*!< LL DMA channel 1   */
#define LL_DMA_CHANNEL_2   0x0004U /*!< LL DMA channel 2   */
#define LL_DMA_CHANNEL_3   0x0008U /*!< LL DMA channel 3   */
#define LL_DMA_CHANNEL_4   0x0010U /*!< LL DMA channel 4   */
#define LL_DMA_CHANNEL_5   0x0020U /*!< LL DMA channel 5   */
#define LL_DMA_CHANNEL_6   0x0040U /*!< LL DMA channel 6   */
#define LL_DMA_CHANNEL_7   0x0080U /*!< LL DMA channel 7   */
#define LL_DMA_CHANNEL_ALL 0x00FFU /*!< LL DMA channel ALL */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DMA_CHANNEL_INSTANCE DMA channel instance
  * @{
  */
/* LPDMA1 channel instances */
#define LL_LPDMA1_CH0  LPDMA1_CH0  /*!< LL LPDMA1 channel 0  */
#define LL_LPDMA1_CH1  LPDMA1_CH1  /*!< LL LPDMA1 channel 1  */
#define LL_LPDMA1_CH2  LPDMA1_CH2  /*!< LL LPDMA1 channel 2  */
#define LL_LPDMA1_CH3  LPDMA1_CH3  /*!< LL LPDMA1 channel 3  */
#if defined(LPDMA1_CH4)
#define LL_LPDMA1_CH4  LPDMA1_CH4  /*!< LL LPDMA1 channel 4  */
#endif /* LPDMA1_CH4 */
#if defined(LPDMA1_CH5)
#define LL_LPDMA1_CH5  LPDMA1_CH5  /*!< LL LPDMA1 channel 5  */
#endif /* LPDMA1_CH5 */
#if defined(LPDMA1_CH6)
#define LL_LPDMA1_CH6  LPDMA1_CH6  /*!< LL LPDMA1 channel 6  */
#endif /* LPDMA1_CH6 */
#if defined(LPDMA1_CH7)
#define LL_LPDMA1_CH7  LPDMA1_CH7  /*!< LL LPDMA1 channel 7  */
#endif /* LPDMA1_CH7 */

#if defined(LPDMA2)
/* LPDMA2 channel instances */
#define LL_LPDMA2_CH0  LPDMA2_CH0  /*!< LL LPDMA2 channel 0  */
#define LL_LPDMA2_CH1  LPDMA2_CH1  /*!< LL LPDMA2 channel 1  */
#define LL_LPDMA2_CH2  LPDMA2_CH2  /*!< LL LPDMA2 channel 2  */
#define LL_LPDMA2_CH3  LPDMA2_CH3  /*!< LL LPDMA2 channel 3  */
#if defined(LPDMA2_CH4)
#define LL_LPDMA2_CH4  LPDMA2_CH4  /*!< LL LPDMA2 channel 4  */
#endif /* LPDMA2_CH4 */
#if defined(LPDMA2_CH5)
#define LL_LPDMA2_CH5  LPDMA2_CH5  /*!< LL LPDMA2 channel 5  */
#endif /* LPDMA2_CH5 */
#if defined(LPDMA2_CH6)
#define LL_LPDMA2_CH6  LPDMA2_CH6  /*!< LL LPDMA2 channel 6  */
#endif /* LPDMA2_CH6 */
#if defined(LPDMA2_CH7)
#define LL_LPDMA2_CH7  LPDMA2_CH7  /*!< LL LPDMA2 channel 7  */
#endif /* LPDMA2_CH7 */
#endif /* LPDMA2 */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_INTERRUPTS DMA Interrupts
  * @{
  */
#define LL_DMA_IT_TC   DMA_CCR_TCIE                                                     /*!< Transfer complete
                                                                                             interrupt               */
#define LL_DMA_IT_HT   DMA_CCR_HTIE                                                     /*!< Half transfer complete
                                                                                             interrupt               */
#define LL_DMA_IT_DTE  DMA_CCR_DTEIE                                                    /*!< Data transfer error
                                                                                             interrupt               */
#define LL_DMA_IT_ULE  DMA_CCR_ULEIE                                                    /*!< Update linked list item
                                                                                             error interrupt         */
#define LL_DMA_IT_USE  DMA_CCR_USEIE                                                    /*!< User setting error
                                                                                             interrupt               */
#define LL_DMA_IT_SUSP DMA_CCR_SUSPIE                                                   /*!< Completed suspension
                                                                                             interrupt               */
#define LL_DMA_IT_TO   DMA_CCR_TOIE                                                     /*!< Trigger overrun
                                                                                             interrupt               */
#define LL_DMA_IT_ALL  (DMA_CCR_TCIE | DMA_CCR_HTIE | DMA_CCR_DTEIE | DMA_CCR_ULEIE | \
                        DMA_CCR_USEIE | DMA_CCR_SUSPIE | DMA_CCR_TOIE)                  /*!< All interrupts          */
/**
  * @}
  */

