MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/** @defgroup DMA_LL_EC_FLAGS DMA Flags
  * @{
  */
#define LL_DMA_FLAG_IDLE DMA_CSR_IDLEF                                                /*!< Idle flag                 */
#define LL_DMA_FLAG_TC   DMA_CSR_TCF                                                  /*!< Transfer complete flag    */
#define LL_DMA_FLAG_HT   DMA_CSR_HTF                                                  /*!< Half transfer complete
                                                                                           flag                      */
#define LL_DMA_FLAG_DTE  DMA_CSR_DTEF                                                 /*!< Data transfer error flag  */
#define LL_DMA_FLAG_ULE  DMA_CSR_ULEF                                                 /*!< Update linked list item
                                                                                           error flag                */
#define LL_DMA_FLAG_USE  DMA_CSR_USEF                                                 /*!< User setting error flag   */
#define LL_DMA_FLAG_SUSP DMA_CSR_SUSPF                                                /*!< Completed suspension flag */
#define LL_DMA_FLAG_TO   DMA_CSR_TOF                                                  /*!< Trigger overrun flag      */
#define LL_DMA_FLAG_ALL  (DMA_CSR_TCF | DMA_CSR_HTF | DMA_CSR_DTEF | DMA_CSR_ULEF | \
                          DMA_CSR_USEF | DMA_CSR_SUSPF | DMA_CSR_TOF)                 /*!< All flags                 */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_PRIORITY_LEVEL Priority Level
  * @{
  */
#define LL_DMA_PRIORITY_LOW_WEIGHT_LOW  (0U)           /*!< Priority level : Low Priority, Low Weight  */
#define LL_DMA_PRIORITY_LOW_WEIGHT_MID  DMA_CCR_PRIO_0 /*!< Priority level : Low Priority, Mid Weight  */
#define LL_DMA_PRIORITY_LOW_WEIGHT_HIGH DMA_CCR_PRIO_1 /*!< Priority level : Low Priority, High Weight */
#define LL_DMA_PRIORITY_HIGH            DMA_CCR_PRIO   /*!< Priority level : High Priority             */
/**
  * @}
  */


/** @defgroup DMA_LL_EC_LINK_STEP_MODE Link Step Mode
  * @{
  */
#define LL_DMA_LINKEDLIST_EXECUTION_Q    (0U)        /*!< Channel executed for the full linked list              */
#define LL_DMA_LINKEDLIST_EXECUTION_NODE DMA_CCR_LSM /*!< Channel executed once for the current linked list item */
/**
  * @}
  */


/** @defgroup DMA_LL_EC_DESTINATION_INCREMENT_MODE Destination Increment Mode
  * @{
  */
#define LL_DMA_DEST_ADDR_FIXED         (0U)          /*!< Destination fixed single/burst       */
#define LL_DMA_DEST_ADDR_INCREMENTED   DMA_CTR1_DINC /*!< Destination incremented single/burst */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DESTINATION_DATA_WIDTH Destination Data Width
  * @{
  */
#define LL_DMA_DEST_DATA_WIDTH_BYTE       (0U)                /*!< Destination data width: byte        */
#define LL_DMA_DEST_DATA_WIDTH_HALFWORD   DMA_CTR1_DDW_LOG2_0 /*!< Destination data width: halfword    */
#define LL_DMA_DEST_DATA_WIDTH_WORD       DMA_CTR1_DDW_LOG2_1 /*!< Destination data width: word        */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DESTINATION_DATA_TRUNCATION_PADDING Destination Data Truncation and Padding
  * @{
  */
#define LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO  (0U)             /*!< If src data width < dest data width:
                                                                    => Right aligned, padded with 0
                                                                       up to the destination data width.
                                                                    If src data width > dest data width:
                                                                    => Right aligned, left truncated
                                                                       down to the destination data width.           */
#define LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN DMA_CTR1_PAM_0   /*!< If src data width < dest data width:
                                                                    => Right aligned, padded with sign extended
                                                                       up to the destination data width.
                                                                    If src data width > dest data width:
                                                                    => Left aligned, right truncated
                                                                       down to the destination data width.           */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SOURCE_INCREMENT_MODE Source Increment Mode
  * @{
  */
#define LL_DMA_SRC_ADDR_FIXED        (0U)          /*!< Source fixed single/burst       */
#define LL_DMA_SRC_ADDR_INCREMENTED  DMA_CTR1_SINC /*!< Source incremented single/burst */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SOURCE_DATA_WIDTH Source Data Width
  * @{
  */
#define LL_DMA_SRC_DATA_WIDTH_BYTE     (0U)                /*!< Source data width: byte        */
#define LL_DMA_SRC_DATA_WIDTH_HALFWORD DMA_CTR1_SDW_LOG2_0 /*!< Source data width: halfword    */
#define LL_DMA_SRC_DATA_WIDTH_WORD     DMA_CTR1_SDW_LOG2_1 /*!< Source data width: word        */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_BLKHW_REQUEST Block Hardware Request
  * @{
  */
#define LL_DMA_HARDWARE_REQUEST_BURST   (0U)          /*!< Hardware request is driven by a peripheral with a hardware
                                                        request/acknowledge protocol at a burst level                */
#define LL_DMA_HARDWARE_REQUEST_BLOCK   DMA_CTR2_BREQ /*!< Hardware request is driven by a peripheral with a hardware
                                                        request/acknowledge protocol at a block level                */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRANSFER_EVENT_MODE Transfer Event Mode
  * @{
  */
#define LL_DMA_DIRECT_XFER_EVENT_BLOCK              (0U)              /*!< The TC (and the HT) event is generated at the
                                                                          (respectively half of the) end of a block  */
#define LL_DMA_LINKEDLIST_XFER_EVENT_BLOCK          LL_DMA_DIRECT_XFER_EVENT_BLOCK  /*!< The TC (and the HT) event is
                                                                                         generated at the (respectively
                                                                                         half of the) end of a block */
#define LL_DMA_LINKEDLIST_XFER_EVENT_NODE           DMA_CTR2_TCEM_1   /*!< The TC (and the HT) event is generated
                                                                           at the (respectively half) end of each
                                                                           linked list item                          */
#define LL_DMA_LINKEDLIST_XFER_EVENT_Q              DMA_CTR2_TCEM   /*!< The TC (and the HT) event is generated at the
                                                                         (respectively half) end of the last
                                                                         linked list item                            */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRIGGER_POLARITY Trigger Polarity
  * @{
  */
#define LL_DMA_TRIGGER_POLARITY_MASKED      (0U)                  /*!< No trigger of the selected DMA request.
                                                                    Masked trigger event                             */
#define LL_DMA_TRIGGER_POLARITY_RISING      DMA_CTR2_TRIGPOL_0  /*!< Trigger of the selected DMA request on the rising
                                                                    edge of the selected trigger event input         */
#define LL_DMA_TRIGGER_POLARITY_FALLING     DMA_CTR2_TRIGPOL_1  /*!< Trigger of the selected DMA request on the falling
                                                                    edge of the selected trigger event input         */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRIGGER_MODE Transfer Trigger Mode
  * @{
  */
#define LL_DMA_TRIGGER_BLOCK_TRANSFER           (0U)                /*!< A block transfer is conditioned
                                                                        by (at least)one hit trigger                  */
#define LL_DMA_TRIGGER_NODE_TRANSFER            DMA_CTR2_TRIGM_1  /*!< A LLI link transfer is conditioned
                                                                      by (at least)one hit trigger                    */
#define LL_DMA_TRIGGER_SINGLE_BURST_TRANSFER    DMA_CTR2_TRIGM    /*!< A Single/Burst transfer is conditioned
                                                                      by (at least) one hit trigger                   */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_FLOW_CONTROL_MODE Flow Control Mode
  * @{
  */
#define LL_DMA_FLOW_CONTROL_DMA    (0U)             /*!< Hardware request is driven by a peripheral with a hardware
                                                        request/acknowledge protocol in DMA flow control mode         */
#define LL_DMA_FLOW_CONTROL_PERIPH DMA_CTR2_PFREQ   /*!< Hardware request is driven by a peripheral with a hardware
                                                        request/acknowledge protocol in peripheral flow control mode  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRANSFER_DIRECTION Transfer Direction
  * @{
  */
#define LL_DMA_DIRECTION_MEMORY_TO_MEMORY DMA_CTR2_SWREQ /*!< Memory to memory direction     */
#define LL_DMA_DIRECTION_PERIPH_TO_MEMORY (0U)           /*!< Peripheral to memory direction.
                                                             Retained to ensure compatibility with other STM32.*/
#define LL_DMA_DIRECTION_MEMORY_TO_PERIPH LL_DMA_DIRECTION_PERIPH_TO_MEMORY  /*!< Memory to peripheral direction.
                                                                                 Retained to ensure compatibility with
                                                                                 other STM32.*/
/**
  * @}
  */

/** @defgroup DMA_LL_EC_PRIVILEGE_ATTRIBUTE Privilege Attribute
  * @{
  */
#define LL_DMA_ATTR_NPRIV (0U) /*!< Non-privileged attribute */
#define LL_DMA_ATTR_PRIV  (1U) /*!< Privileged attribute     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_LINKEDLIST_REGISTER_UPDATE Linked list register update
  * @{
  */
#define LL_DMA_UPDATE_CTR1 DMA_CLLR_UT1 /*!< Update CTR1 register from memory : available for all DMA channels       */
#define LL_DMA_UPDATE_CTR2 DMA_CLLR_UT2 /*!< Update CTR2 register from memory : available for all DMA channels       */
#define LL_DMA_UPDATE_CBR1 DMA_CLLR_UB1 /*!< Update CBR1 register from memory : available for all DMA channels       */
#define LL_DMA_UPDATE_CSAR DMA_CLLR_USA /*!< Update CSAR register from memory : available for all DMA channels       */
#define LL_DMA_UPDATE_CDAR DMA_CLLR_UDA /*!< Update CDAR register from memory : available for all DMA channels       */
#define LL_DMA_UPDATE_CLLR DMA_CLLR_ULL /*!< Update CLLR register from memory : available for all DMA channels       */
#define LL_DMA_UPDATE_ALL  (DMA_CLLR_UT1 | DMA_CLLR_UT2 | DMA_CLLR_UB1 | DMA_CLLR_USA | \
                            DMA_CLLR_UDA | DMA_CLLR_ULL)
/**
  * @}
  */

/** @defgroup DMA_LL_EC_REQUEST_SELECTION Request Selection
  * @{
  */
/* LPDMA1 Hardware Requests */
#define LL_LPDMA1_REQUEST_ADC1         0U  /*!< LPDMA1 HW Request is ADC1         */
#if defined(ADC2)
#define LL_LPDMA1_REQUEST_ADC2         1U  /*!< LPDMA1 HW Request is ADC2         */
#endif /* ADC2 */
#define LL_LPDMA1_REQUEST_TIM6_UPD     2U  /*!< LPDMA1 HW Request is TIM6_UPD     */
#define LL_LPDMA1_REQUEST_TIM7_UPD     3U  /*!< LPDMA1 HW Request is TIM7_UPD     */
#define LL_LPDMA1_REQUEST_SPI1_RX      4U  /*!< LPDMA1 HW Request is SPI1_RX      */
#define LL_LPDMA1_REQUEST_SPI1_TX      5U  /*!< LPDMA1 HW Request is SPI1_TX      */
#define LL_LPDMA1_REQUEST_SPI2_RX      6U  /*!< LPDMA1 HW Request is SPI2_RX      */
#define LL_LPDMA1_REQUEST_SPI2_TX      7U  /*!< LPDMA1 HW Request is SPI2_TX      */
#if defined(SPI3)
#define LL_LPDMA1_REQUEST_SPI3_RX      8U  /*!< LPDMA1 HW Request is SPI3_RX      */
#define LL_LPDMA1_REQUEST_SPI3_TX      9U  /*!< LPDMA1 HW Request is SPI3_TX      */
#endif /* SPI3 */
#define LL_LPDMA1_REQUEST_I2C1_RX      10U /*!< LPDMA1 HW Request is I2C1_RX      */
#define LL_LPDMA1_REQUEST_I2C1_TX      11U /*!< LPDMA1 HW Request is I2C1_TX      */
#define LL_LPDMA1_REQUEST_USART1_RX    12U /*!< LPDMA1 HW Request is USART1_RX    */
#define LL_LPDMA1_REQUEST_USART1_TX    13U /*!< LPDMA1 HW Request is USART1_TX    */
#define LL_LPDMA1_REQUEST_USART2_RX    14U /*!< LPDMA1 HW Request is USART2_RX    */
#define LL_LPDMA1_REQUEST_USART2_TX    15U /*!< LPDMA1 HW Request is USART2_TX    */
#if defined(USART3)
#define LL_LPDMA1_REQUEST_USART3_RX    16U /*!< LPDMA1 HW Request is USART3_RX    */
#define LL_LPDMA1_REQUEST_USART3_TX    17U /*!< LPDMA1 HW Request is USART3_TX    */
#endif /* USART3 */
#define LL_LPDMA1_REQUEST_UART4_RX     18U /*!< LPDMA1 HW Request is UART4_RX     */
#define LL_LPDMA1_REQUEST_UART4_TX     19U /*!< LPDMA1 HW Request is UART4_TX     */
#define LL_LPDMA1_REQUEST_UART5_RX     20U /*!< LPDMA1 HW Request is UART5_RX     */
#define LL_LPDMA1_REQUEST_UART5_TX     21U /*!< LPDMA1 HW Request is UART5_TX     */
#define LL_LPDMA1_REQUEST_LPUART1_RX   22U /*!< LPDMA1 HW Request is LPUART1_RX   */
#define LL_LPDMA1_REQUEST_LPUART1_TX   23U /*!< LPDMA1 HW Request is LPUART1_TX   */
#define LL_LPDMA1_REQUEST_TIM1_CC1     24U /*!< LPDMA1 HW Request is TIM1_CC1     */
#define LL_LPDMA1_REQUEST_TIM1_CC2     25U /*!< LPDMA1 HW Request is TIM1_CC2     */
#define LL_LPDMA1_REQUEST_TIM1_CC3     26U /*!< LPDMA1 HW Request is TIM1_CC3     */
#define LL_LPDMA1_REQUEST_TIM1_CC4     27U /*!< LPDMA1 HW Request is TIM1_CC4     */
#define LL_LPDMA1_REQUEST_TIM1_UPD     28U /*!< LPDMA1 HW Request is TIM1_UPD     */
#define LL_LPDMA1_REQUEST_TIM1_TRGI    29U /*!< LPDMA1 HW Request is TIM1_TRGI    */
#define LL_LPDMA1_REQUEST_TIM1_COM     30U /*!< LPDMA1 HW Request is TIM1_COM     */
#define LL_LPDMA1_REQUEST_TIM2_CC1     31U /*!< LPDMA1 HW Request is TIM2_CC1     */
#define LL_LPDMA1_REQUEST_TIM2_CC2     32U /*!< LPDMA1 HW Request is TIM2_CC2     */
#define LL_LPDMA1_REQUEST_TIM2_CC3     33U /*!< LPDMA1 HW Request is TIM2_CC3     */
#define LL_LPDMA1_REQUEST_TIM2_CC4     34U /*!< LPDMA1 HW Request is TIM2_CC4     */
#define LL_LPDMA1_REQUEST_TIM2_UPD     35U /*!< LPDMA1 HW Request is TIM2_UPD     */
#define LL_LPDMA1_REQUEST_TIM2_TRGI    36U /*!< LPDMA1 HW Request is TIM2_TRGI    */
#if defined(TIM5)
#define LL_LPDMA1_REQUEST_TIM5_CC1     37U /*!< LPDMA1 HW Request is TIM5_CC1     */
#define LL_LPDMA1_REQUEST_TIM5_CC2     38U /*!< LPDMA1 HW Request is TIM5_CC2     */
#define LL_LPDMA1_REQUEST_TIM5_CC3     39U /*!< LPDMA1 HW Request is TIM5_CC3     */
#define LL_LPDMA1_REQUEST_TIM5_CC4     40U /*!< LPDMA1 HW Request is TIM5_CC4     */
#define LL_LPDMA1_REQUEST_TIM5_UPD     41U /*!< LPDMA1 HW Request is TIM5_UPD     */
#define LL_LPDMA1_REQUEST_TIM5_TRGI    42U /*!< LPDMA1 HW Request is TIM5_TRGI    */
#endif /* TIM5 */
#define LL_LPDMA1_REQUEST_TIM15_CC1    43U /*!< LPDMA1 HW Request is TIM15_CC1    */
#define LL_LPDMA1_REQUEST_TIM15_CC2    44U /*!< LPDMA1 HW Request is TIM15_CC2    */
#define LL_LPDMA1_REQUEST_TIM15_UPD    45U /*!< LPDMA1 HW Request is TIM15_UPD    */
#define LL_LPDMA1_REQUEST_TIM15_TRGI   46U /*!< LPDMA1 HW Request is TIM15_TRGI   */
#define LL_LPDMA1_REQUEST_TIM15_COM    47U /*!< LPDMA1 HW Request is TIM15_COM    */
#if defined(TIM16)
#define LL_LPDMA1_REQUEST_TIM16_CC1    48U /*!< LPDMA1 HW Request is TIM16_CC1    */
#define LL_LPDMA1_REQUEST_TIM16_UPD    49U /*!< LPDMA1 HW Request is TIM16_UPD    */
#endif /* TIM16 */
#if defined(TIM17)
#define LL_LPDMA1_REQUEST_TIM17_CC1    50U /*!< LPDMA1 HW Request is TIM17_CC1    */
#define LL_LPDMA1_REQUEST_TIM17_UPD    51U /*!< LPDMA1 HW Request is TIM17_UPD    */
#endif /* TIM17 */
#if defined(LPTIM1)
#define LL_LPDMA1_REQUEST_LPTIM1_IC1   52U /*!< LPDMA1 HW Request is LPTIM1_IC1   */
#define LL_LPDMA1_REQUEST_LPTIM1_IC2   53U /*!< LPDMA1 HW Request is LPTIM1_IC2   */
#define LL_LPDMA1_REQUEST_LPTIM1_UE    54U /*!< LPDMA1 HW Request is LPTIM1_UE    */
#endif /* LPTIM1 */
#define LL_LPDMA1_REQUEST_CORDIC_RD    55U /*!< LPDMA1 HW Request is CORDIC_RD    */
#define LL_LPDMA1_REQUEST_CORDIC_WR    56U /*!< LPDMA1 HW Request is CORDIC_WR    */
#define LL_LPDMA1_REQUEST_I3C1_RX      57U /*!< LPDMA1 HW Request is I3C1_RX      */
#define LL_LPDMA1_REQUEST_I3C1_TX      58U /*!< LPDMA1 HW Request is I3C1_TX      */
#define LL_LPDMA1_REQUEST_I3C1_TC      59U /*!< LPDMA1 HW Request is I3C1_TC      */
#define LL_LPDMA1_REQUEST_I3C1_RS      60U /*!< LPDMA1 HW Request is I3C1_RS      */
#define LL_LPDMA1_REQUEST_AES_OUT      61U /*!< LPDMA1 HW Request is AES_OUT      */
#define LL_LPDMA1_REQUEST_AES_IN       62U /*!< LPDMA1 HW Request is AES_IN       */
#define LL_LPDMA1_REQUEST_HASH_IN      63U /*!< LPDMA1 HW Request is HASH_IN      */
#if defined(I2C2)
#define LL_LPDMA1_REQUEST_I2C2_RX      64U /*!< LPDMA1 HW Request is I2C2_RX      */
#define LL_LPDMA1_REQUEST_I2C2_TX      65U /*!< LPDMA1 HW Request is I2C2_TX      */
#endif /* I2C2 */
#define LL_LPDMA1_REQUEST_TIM8_CC1     66U /*!< LPDMA1 HW Request is TIM8_CC1     */
#define LL_LPDMA1_REQUEST_TIM8_CC2     67U /*!< LPDMA1 HW Request is TIM8_CC2     */
#define LL_LPDMA1_REQUEST_TIM8_CC3     68U /*!< LPDMA1 HW Request is TIM8_CC3     */
#define LL_LPDMA1_REQUEST_TIM8_CC4     69U /*!< LPDMA1 HW Request is TIM8_CC4     */
#define LL_LPDMA1_REQUEST_TIM8_UPD     70U /*!< LPDMA1 HW Request is TIM8_UPD     */
#define LL_LPDMA1_REQUEST_TIM8_TRGI    71U /*!< LPDMA1 HW Request is TIM8_TRGI    */
#define LL_LPDMA1_REQUEST_TIM8_COM     72U /*!< LPDMA1 HW Request is TIM8_COM     */
#define LL_LPDMA1_REQUEST_DAC1_CH1     73U /*!< LPDMA1 HW Request is DAC1_CH1     */
#if defined(DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
#define LL_LPDMA1_REQUEST_DAC1_CH2     74U /*!< LPDMA1 HW Request is DAC1_CH2     */
#endif /* DAC_NB_OF_CHANNEL == 2UL */
#if defined(USART6)
#define LL_LPDMA1_REQUEST_USART6_RX    75U /*!< LPDMA1 HW Request is USART6_RX    */
#define LL_LPDMA1_REQUEST_USART6_TX    76U /*!< LPDMA1 HW Request is USART6_TX    */
#endif /* USART6 */
#if defined(UART7)
#define LL_LPDMA1_REQUEST_UART7_TX     77U /*!< LPDMA1 HW Request is UART7_TX     */
#define LL_LPDMA1_REQUEST_UART7_RX     78U /*!< LPDMA1 HW Request is UART7_RX     */
#endif /* UART7 */
#if defined(ADC3)
#define LL_LPDMA1_REQUEST_ADC3         79U /*!< LPDMA1 HW Request is ADC3         */
#endif /* ADC3 */
#if defined(TIM3)
#define LL_LPDMA1_REQUEST_TIM3_CC1     80U /*!< LPDMA1 HW Request is TIM3_CC1     */
#define LL_LPDMA1_REQUEST_TIM3_CC2     81U /*!< LPDMA1 HW Request is TIM3_CC2     */
#define LL_LPDMA1_REQUEST_TIM3_CC3     82U /*!< LPDMA1 HW Request is TIM3_CC3     */
#define LL_LPDMA1_REQUEST_TIM3_CC4     83U /*!< LPDMA1 HW Request is TIM3_CC4     */
#define LL_LPDMA1_REQUEST_TIM3_UPD     84U /*!< LPDMA1 HW Request is TIM3_UPD     */
#define LL_LPDMA1_REQUEST_TIM3_TRGI    85U /*!< LPDMA1 HW Request is TIM3_TRGI    */
#endif /* TIM3 */
#if defined(TIM4)
#define LL_LPDMA1_REQUEST_TIM4_CC1     86U /*!< LPDMA1 HW Request is TIM4_CC1     */
#define LL_LPDMA1_REQUEST_TIM4_CC2     87U /*!< LPDMA1 HW Request is TIM4_CC2     */
#define LL_LPDMA1_REQUEST_TIM4_CC3     88U /*!< LPDMA1 HW Request is TIM4_CC3     */
#define LL_LPDMA1_REQUEST_TIM4_CC4     89U /*!< LPDMA1 HW Request is TIM4_CC4     */
#define LL_LPDMA1_REQUEST_TIM4_UPD     90U /*!< LPDMA1 HW Request is TIM4_UPD     */
#define LL_LPDMA1_REQUEST_TIM4_TRGI    91U /*!< LPDMA1 HW Request is TIM4_TRGI    */
#endif /* TIM4 */
#if defined(SAES)
#define LL_LPDMA1_REQUEST_SAES_OUT     92U /*!< LPDMA1 HW Request is SAES_OUT     */
#define LL_LPDMA1_REQUEST_SAES_IN      93U /*!< LPDMA1 HW Request is SAES_IN      */
#endif /* SAES */
#if defined(XSPI1)
#define LL_LPDMA1_REQUEST_XSPI1        94U /*!< LPDMA1 HW Request is XSPI1        */
#endif /* XSPI1 */

