MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
#if defined(LPDMA2)
/* LPDMA2 Hardware Requests */
#define LL_LPDMA2_REQUEST_ADC1         0U  /*!< LPDMA2 HW Request is ADC1         */
#if defined(ADC2)
#define LL_LPDMA2_REQUEST_ADC2         1U  /*!< LPDMA2 HW Request is ADC2         */
#endif /* ADC2 */
#define LL_LPDMA2_REQUEST_TIM6_UPD     2U  /*!< LPDMA2 HW Request is TIM6_UPD     */
#define LL_LPDMA2_REQUEST_TIM7_UPD     3U  /*!< LPDMA2 HW Request is TIM7_UPD     */
#define LL_LPDMA2_REQUEST_SPI2S1_RX    4U  /*!< LPDMA2 HW Request is SPI2S1_RX    */
#define LL_LPDMA2_REQUEST_SPI1_RX      4U  /*!< LPDMA2 HW Request is SPI1_RX      */
#define LL_LPDMA2_REQUEST_SPI1_TX      5U  /*!< LPDMA2 HW Request is SPI1_TX      */
#define LL_LPDMA2_REQUEST_SPI2_RX      6U  /*!< LPDMA2 HW Request is SPI2_RX      */
#define LL_LPDMA2_REQUEST_SPI2_TX      7U  /*!< LPDMA2 HW Request is SPI2_TX      */
#if defined(SPI3)
#define LL_LPDMA2_REQUEST_SPI3_RX      8U  /*!< LPDMA2 HW Request is SPI3_RX      */
#define LL_LPDMA2_REQUEST_SPI3_TX      9U  /*!< LPDMA2 HW Request is SPI3_TX      */
#endif /* SPI3 */
#define LL_LPDMA2_REQUEST_I2C1_RX      10U /*!< LPDMA2 HW Request is I2C1_RX      */
#define LL_LPDMA2_REQUEST_I2C1_TX      11U /*!< LPDMA2 HW Request is I2C1_TX      */
#define LL_LPDMA2_REQUEST_USART1_RX    12U /*!< LPDMA2 HW Request is USART1_RX    */
#define LL_LPDMA2_REQUEST_USART1_TX    13U /*!< LPDMA2 HW Request is USART1_TX    */
#define LL_LPDMA2_REQUEST_USART2_RX    14U /*!< LPDMA2 HW Request is USART2_RX    */
#define LL_LPDMA2_REQUEST_USART2_TX    15U /*!< LPDMA2 HW Request is USART2_TX    */
#if defined(USART3)
#define LL_LPDMA2_REQUEST_USART3_RX    16U /*!< LPDMA2 HW Request is USART3_RX    */
#define LL_LPDMA2_REQUEST_USART3_TX    17U /*!< LPDMA2 HW Request is USART3_TX    */
#endif /* USART3 */
#define LL_LPDMA2_REQUEST_UART4_RX     18U /*!< LPDMA2 HW Request is UART4_RX     */
#define LL_LPDMA2_REQUEST_UART4_TX     19U /*!< LPDMA2 HW Request is UART4_TX     */
#define LL_LPDMA2_REQUEST_UART5_RX     20U /*!< LPDMA2 HW Request is UART5_RX     */
#define LL_LPDMA2_REQUEST_UART5_TX     21U /*!< LPDMA2 HW Request is UART5_TX     */
#define LL_LPDMA2_REQUEST_LPUART1_RX   22U /*!< LPDMA2 HW Request is LPUART1_RX   */
#define LL_LPDMA2_REQUEST_LPUART1_TX   23U /*!< LPDMA2 HW Request is LPUART1_TX   */
#define LL_LPDMA2_REQUEST_TIM1_CC1     24U /*!< LPDMA2 HW Request is TIM1_CC1     */
#define LL_LPDMA2_REQUEST_TIM1_CC2     25U /*!< LPDMA2 HW Request is TIM1_CC2     */
#define LL_LPDMA2_REQUEST_TIM1_CC3     26U /*!< LPDMA2 HW Request is TIM1_CC3     */
#define LL_LPDMA2_REQUEST_TIM1_CC4     27U /*!< LPDMA2 HW Request is TIM1_CC4     */
#define LL_LPDMA2_REQUEST_TIM1_UPD     28U /*!< LPDMA2 HW Request is TIM1_UPD     */
#define LL_LPDMA2_REQUEST_TIM1_TRGI    29U /*!< LPDMA2 HW Request is TIM1_TRGI    */
#define LL_LPDMA2_REQUEST_TIM1_COM     30U /*!< LPDMA2 HW Request is TIM1_COM     */
#define LL_LPDMA2_REQUEST_TIM2_CC1     31U /*!< LPDMA2 HW Request is TIM2_CC1     */
#define LL_LPDMA2_REQUEST_TIM2_CC2     32U /*!< LPDMA2 HW Request is TIM2_CC2     */
#define LL_LPDMA2_REQUEST_TIM2_CC3     33U /*!< LPDMA2 HW Request is TIM2_CC3     */
#define LL_LPDMA2_REQUEST_TIM2_CC4     34U /*!< LPDMA2 HW Request is TIM2_CC4     */
#define LL_LPDMA2_REQUEST_TIM2_UPD     35U /*!< LPDMA2 HW Request is TIM2_UPD     */
#define LL_LPDMA2_REQUEST_TIM2_TRGI    36U /*!< LPDMA2 HW Request is TIM2_TRGI    */
#if defined(TIM5)
#define LL_LPDMA2_REQUEST_TIM5_CC1     37U /*!< LPDMA2 HW Request is TIM5_CC1     */
#define LL_LPDMA2_REQUEST_TIM5_CC2     38U /*!< LPDMA2 HW Request is TIM5_CC2     */
#define LL_LPDMA2_REQUEST_TIM5_CC3     39U /*!< LPDMA2 HW Request is TIM5_CC3     */
#define LL_LPDMA2_REQUEST_TIM5_CC4     40U /*!< LPDMA2 HW Request is TIM5_CC4     */
#define LL_LPDMA2_REQUEST_TIM5_UPD     41U /*!< LPDMA2 HW Request is TIM5_UPD     */
#define LL_LPDMA2_REQUEST_TIM5_TRGI    42U /*!< LPDMA2 HW Request is TIM5_TRGI    */
#endif /* TIM5 */
#define LL_LPDMA2_REQUEST_TIM15_CC1    43U /*!< LPDMA2 HW Request is TIM15_CC1    */
#define LL_LPDMA2_REQUEST_TIM15_CC2    44U /*!< LPDMA2 HW Request is TIM15_CC2    */
#define LL_LPDMA2_REQUEST_TIM15_UPD    45U /*!< LPDMA2 HW Request is TIM15_UPD    */
#define LL_LPDMA2_REQUEST_TIM15_TRGI   46U /*!< LPDMA2 HW Request is TIM15_TRGI   */
#define LL_LPDMA2_REQUEST_TIM15_COM    47U /*!< LPDMA2 HW Request is TIM15_COM    */
#if defined(TIM16)
#define LL_LPDMA2_REQUEST_TIM16_CC1    48U /*!< LPDMA2 HW Request is TIM16_CC1    */
#define LL_LPDMA2_REQUEST_TIM16_UPD    49U /*!< LPDMA2 HW Request is TIM16_UPD    */
#endif /* TIM16 */
#if defined(TIM17)
#define LL_LPDMA2_REQUEST_TIM17_CC1    50U /*!< LPDMA2 HW Request is TIM17_CC1    */
#define LL_LPDMA2_REQUEST_TIM17_UPD    51U /*!< LPDMA2 HW Request is TIM17_UPD    */
#endif /* TIM17 */
#if defined(LPTIM1)
#define LL_LPDMA2_REQUEST_LPTIM1_IC1   52U /*!< LPDMA2 HW Request is LPTIM1_IC1   */
#define LL_LPDMA2_REQUEST_LPTIM1_IC2   53U /*!< LPDMA2 HW Request is LPTIM1_IC2   */
#define LL_LPDMA2_REQUEST_LPTIM1_UE    54U /*!< LPDMA2 HW Request is LPTIM1_UE    */
#endif /* LPTIM1 */
#define LL_LPDMA2_REQUEST_CORDIC_RD    55U /*!< LPDMA2 HW Request is CORDIC_RD    */
#define LL_LPDMA2_REQUEST_CORDIC_WR    56U /*!< LPDMA2 HW Request is CORDIC_WR    */
#define LL_LPDMA2_REQUEST_I3C1_RX      57U /*!< LPDMA2 HW Request is I3C1_RX      */
#define LL_LPDMA2_REQUEST_I3C1_TX      58U /*!< LPDMA2 HW Request is I3C1_TX      */
#define LL_LPDMA2_REQUEST_I3C1_TC      59U /*!< LPDMA2 HW Request is I3C1_TC      */
#define LL_LPDMA2_REQUEST_I3C1_RS      60U /*!< LPDMA2 HW Request is I3C1_RS      */
#define LL_LPDMA2_REQUEST_AES_OUT      61U /*!< LPDMA2 HW Request is AES_OUT      */
#define LL_LPDMA2_REQUEST_AES_IN       62U /*!< LPDMA2 HW Request is AES_IN       */
#define LL_LPDMA2_REQUEST_HASH_IN      63U /*!< LPDMA2 HW Request is HASH_IN      */
#if defined(I2C2)
#define LL_LPDMA2_REQUEST_I2C2_RX      64U /*!< LPDMA2 HW Request is I2C2_RX      */
#define LL_LPDMA2_REQUEST_I2C2_TX      65U /*!< LPDMA2 HW Request is I2C2_TX      */
#endif /* I2C2 */
#define LL_LPDMA2_REQUEST_TIM8_CC1     66U /*!< LPDMA2 HW Request is TIM8_CC1     */
#define LL_LPDMA2_REQUEST_TIM8_CC2     67U /*!< LPDMA2 HW Request is TIM8_CC2     */
#define LL_LPDMA2_REQUEST_TIM8_CC3     68U /*!< LPDMA2 HW Request is TIM8_CC3     */
#define LL_LPDMA2_REQUEST_TIM8_CC4     69U /*!< LPDMA2 HW Request is TIM8_CC4     */
#define LL_LPDMA2_REQUEST_TIM8_UPD     70U /*!< LPDMA2 HW Request is TIM8_UPD     */
#define LL_LPDMA2_REQUEST_TIM8_TRGI    71U /*!< LPDMA2 HW Request is TIM8_TRGI    */
#define LL_LPDMA2_REQUEST_TIM8_COM     72U /*!< LPDMA2 HW Request is TIM8_COM     */
#define LL_LPDMA2_REQUEST_DAC1_CH1     73U /*!< LPDMA2 HW Request is DAC1_CH1     */
#if defined(DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
#define LL_LPDMA2_REQUEST_DAC1_CH2     74U /*!< LPDMA2 HW Request is DAC1_CH2     */
#endif /* DAC_NB_OF_CHANNEL == 2UL */
#if defined(USART6)
#define LL_LPDMA2_REQUEST_USART6_RX    75U /*!< LPDMA2 HW Request is USART6_RX    */
#define LL_LPDMA2_REQUEST_USART6_TX    76U /*!< LPDMA2 HW Request is USART6_TX    */
#endif /* USART6 */
#if defined(UART7)
#define LL_LPDMA2_REQUEST_UART7_TX     77U /*!< LPDMA2 HW Request is UART7_TX     */
#define LL_LPDMA2_REQUEST_UART7_RX     78U /*!< LPDMA2 HW Request is UART7_RX     */
#endif /* UART7 */
#if defined(ADC3)
#define LL_LPDMA2_REQUEST_ADC3         79U /*!< LPDMA2 HW Request is ADC3         */
#endif /* ADC3 */
#if defined(TIM3)
#define LL_LPDMA2_REQUEST_TIM3_CC1     80U /*!< LPDMA2 HW Request is TIM3_CC1     */
#define LL_LPDMA2_REQUEST_TIM3_CC2     81U /*!< LPDMA2 HW Request is TIM3_CC2     */
#define LL_LPDMA2_REQUEST_TIM3_CC3     82U /*!< LPDMA2 HW Request is TIM3_CC3     */
#define LL_LPDMA2_REQUEST_TIM3_CC4     83U /*!< LPDMA2 HW Request is TIM3_CC4     */
#define LL_LPDMA2_REQUEST_TIM3_UPD     84U /*!< LPDMA2 HW Request is TIM3_UPD     */
#define LL_LPDMA2_REQUEST_TIM3_TRGI    85U /*!< LPDMA2 HW Request is TIM3_TRGI    */
#endif /* TIM3 */
#if defined(TIM4)
#define LL_LPDMA2_REQUEST_TIM4_CC1     86U /*!< LPDMA2 HW Request is TIM4_CC1     */
#define LL_LPDMA2_REQUEST_TIM4_CC2     87U /*!< LPDMA2 HW Request is TIM4_CC2     */
#define LL_LPDMA2_REQUEST_TIM4_CC3     88U /*!< LPDMA2 HW Request is TIM4_CC3     */
#define LL_LPDMA2_REQUEST_TIM4_CC4     89U /*!< LPDMA2 HW Request is TIM4_CC4     */
#define LL_LPDMA2_REQUEST_TIM4_UPD     90U /*!< LPDMA2 HW Request is TIM4_UPD     */
#define LL_LPDMA2_REQUEST_TIM4_TRGI    91U /*!< LPDMA2 HW Request is TIM4_TRGI    */
#endif /* TIM4 */
#if defined(SAES)
#define LL_LPDMA2_REQUEST_SAES_OUT     92U /*!< LPDMA2 HW Request is SAES_OUT     */
#define LL_LPDMA2_REQUEST_SAES_IN      93U /*!< LPDMA2 HW Request is SAES_IN      */
#endif /* SAES */
#if defined(XSPI1)
#define LL_LPDMA2_REQUEST_XSPI1        94U /*!< LPDMA2 HW Request is XSPI1        */
#endif /* XSPI1 */
#endif /* LPDMA2 */
/**
  * @}
  */

