MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/** @defgroup DMA_LL_EC_TRIGGER_SELECTION Trigger Selection
  * @{
  */
/* LPDMA1 Hardware Triggers */
#define LL_LPDMA1_TRIGGER_EXTI0            0U  /*!< LPDMA1 HW Trigger is EXTI0           */
#define LL_LPDMA1_TRIGGER_EXTI1            1U  /*!< LPDMA1 HW Trigger is EXTI1           */
#define LL_LPDMA1_TRIGGER_EXTI2            2U  /*!< LPDMA1 HW Trigger is EXTI2           */
#define LL_LPDMA1_TRIGGER_EXTI3            3U  /*!< LPDMA1 HW Trigger is EXTI3           */
#define LL_LPDMA1_TRIGGER_EXTI4            4U  /*!< LPDMA1 HW Trigger is EXTI4           */
#define LL_LPDMA1_TRIGGER_EXTI5            5U  /*!< LPDMA1 HW Trigger is EXTI5           */
#define LL_LPDMA1_TRIGGER_EXTI6            6U  /*!< LPDMA1 HW Trigger is EXTI6           */
#define LL_LPDMA1_TRIGGER_EXTI7            7U  /*!< LPDMA1 HW Trigger is EXTI7           */
#define LL_LPDMA1_TRIGGER_TAMP_TRG1        8U  /*!< LPDMA1 HW Trigger is TAMP_TRG1       */
#define LL_LPDMA1_TRIGGER_TAMP_TRG2        9U  /*!< LPDMA1 HW Trigger is TAMP_TRG2       */
#define LL_LPDMA1_TRIGGER_TAMP_TRG3        10U /*!< LPDMA1 HW Trigger is TAMP_TRG3       */
#if defined(LPTIM1)
#define LL_LPDMA1_TRIGGER_LPTIM1_CH1       11U /*!< LPDMA1 HW Trigger is LPTIM1_CH1      */
#define LL_LPDMA1_TRIGGER_LPTIM1_CH2       12U /*!< LPDMA1 HW Trigger is LPTIM1_CH2      */
#endif /* LPTIM1 */
#define LL_LPDMA1_TRIGGER_RTC_ALRA_TRG     13U /*!< LPDMA1 HW Trigger is RTC_ALRA_TRG    */
#define LL_LPDMA1_TRIGGER_RTC_ALRB_TRG     14U /*!< LPDMA1 HW Trigger is RTC_ALRB_TRG    */
#define LL_LPDMA1_TRIGGER_RTC_WUT_TRG      15U /*!< LPDMA1 HW Trigger is RTC_WUT_TRG     */
#define LL_LPDMA1_TRIGGER_TIM2_TRGO        16U /*!< LPDMA1 HW Trigger is TIM2_TRGO       */
#define LL_LPDMA1_TRIGGER_TIM15_TRGO       17U /*!< LPDMA1 HW Trigger is TIM15_TRGO      */
#define LL_LPDMA1_TRIGGER_COMP1_OUT        18U /*!< LPDMA1 HW Trigger is COMP1_OUT       */
#define LL_LPDMA1_TRIGGER_EVENTOUT         19U /*!< LPDMA1 HW Trigger is EVENTOUT        */
#define LL_LPDMA1_TRIGGER_LPDMA1_CH0_TC    20U /*!< LPDMA1 HW Trigger is LPDMA1_CH0_TC   */
#define LL_LPDMA1_TRIGGER_LPDMA1_CH1_TC    21U /*!< LPDMA1 HW Trigger is LPDMA1_CH1_TC   */
#define LL_LPDMA1_TRIGGER_LPDMA1_CH2_TC    22U /*!< LPDMA1 HW Trigger is LPDMA1_CH2_TC   */
#define LL_LPDMA1_TRIGGER_LPDMA1_CH3_TC    23U /*!< LPDMA1 HW Trigger is LPDMA1_CH3_TC   */
#if defined (LPDMA1_CH4)
#define LL_LPDMA1_TRIGGER_LPDMA1_CH4_TC    24U /*!< LPDMA1 HW Trigger is LPDMA1_CH4_TC   */
#endif /* LPDMA1_CH4 */
#if defined (LPDMA1_CH5)
#define LL_LPDMA1_TRIGGER_LPDMA1_CH5_TC    25U /*!< LPDMA1 HW Trigger is LPDMA1_CH5_TC   */
#endif /* LPDMA1_CH5 */
#if defined (LPDMA1_CH6)
#define LL_LPDMA1_TRIGGER_LPDMA1_CH6_TC    26U /*!< LPDMA1 HW Trigger is LPDMA1_CH6_TC   */
#endif /* LPDMA1_CH6 */
#if defined (LPDMA1_CH7)
#define LL_LPDMA1_TRIGGER_LPDMA1_CH7_TC    27U /*!< LPDMA1 HW Trigger is LPDMA1_CH7_TC   */
#endif /* LPDMA1_CH7 */
#if defined(LPDMA2)
#define LL_LPDMA1_TRIGGER_LPDMA2_CH0_TC    28U /*!< LPDMA1 HW Trigger is LPDMA2_CH0_TC   */
#define LL_LPDMA1_TRIGGER_LPDMA2_CH1_TC    29U /*!< LPDMA1 HW Trigger is LPDMA2_CH1_TC   */
#define LL_LPDMA1_TRIGGER_LPDMA2_CH2_TC    30U /*!< LPDMA1 HW Trigger is LPDMA2_CH2_TC   */
#define LL_LPDMA1_TRIGGER_LPDMA2_CH3_TC    31U /*!< LPDMA1 HW Trigger is LPDMA2_CH3_TC   */
#if defined (LPDMA2_CH4)
#define LL_LPDMA1_TRIGGER_LPDMA2_CH4_TC    32U /*!< LPDMA1 HW Trigger is LPDMA2_CH4_TC   */
#endif /* LPDMA2_CH4 */
#if defined (LPDMA2_CH5)
#define LL_LPDMA1_TRIGGER_LPDMA2_CH5_TC    33U /*!< LPDMA1 HW Trigger is LPDMA2_CH5_TC   */
#endif /* LPDMA2_CH5 */
#if defined (LPDMA2_CH6)
#define LL_LPDMA1_TRIGGER_LPDMA2_CH6_TC    34U /*!< LPDMA1 HW Trigger is LPDMA2_CH6_TC   */
#endif /* LPDMA2_CH6 */
#if defined (LPDMA2_CH7)
#define LL_LPDMA1_TRIGGER_LPDMA2_CH7_TC    35U /*!< LPDMA1 HW Trigger is LPDMA2_CH7_TC   */
#endif /* LPDMA2_CH7 */
#endif /* LPDMA2 */
#if defined(COMP2)
#define LL_LPDMA1_TRIGGER_COMP2_OUT        36U /*!< LPDMA1 HW Trigger is COMP2_OUT       */
#endif /* COMP2 */

#if defined(LPDMA2)
/* LPDMA2 Hardware Triggers */
#define LL_LPDMA2_TRIGGER_EXTI0            0U  /*!< LPDMA2 HW Trigger is EXTI0           */
#define LL_LPDMA2_TRIGGER_EXTI1            1U  /*!< LPDMA2 HW Trigger is EXTI1           */
#define LL_LPDMA2_TRIGGER_EXTI2            2U  /*!< LPDMA2 HW Trigger is EXTI2           */
#define LL_LPDMA2_TRIGGER_EXTI3            3U  /*!< LPDMA2 HW Trigger is EXTI3           */
#define LL_LPDMA2_TRIGGER_EXTI4            4U  /*!< LPDMA2 HW Trigger is EXTI4           */
#define LL_LPDMA2_TRIGGER_EXTI5            5U  /*!< LPDMA2 HW Trigger is EXTI5           */
#define LL_LPDMA2_TRIGGER_EXTI6            6U  /*!< LPDMA2 HW Trigger is EXTI6           */
#define LL_LPDMA2_TRIGGER_EXTI7            7U  /*!< LPDMA2 HW Trigger is EXTI7           */
#define LL_LPDMA2_TRIGGER_TAMP_TRG1        8U  /*!< LPDMA2 HW Trigger is TAMP_TRG1       */
#define LL_LPDMA2_TRIGGER_TAMP_TRG2        9U  /*!< LPDMA2 HW Trigger is TAMP_TRG2       */
#define LL_LPDMA2_TRIGGER_TAMP_TRG3        10U /*!< LPDMA2 HW Trigger is TAMP_TRG3       */
#if defined(LPTIM1)
#define LL_LPDMA2_TRIGGER_LPTIM1_CH1       11U /*!< LPDMA2 HW Trigger is LPTIM1_CH1      */
#define LL_LPDMA2_TRIGGER_LPTIM1_CH2       12U /*!< LPDMA2 HW Trigger is LPTIM1_CH2      */
#endif /* LPTIM1 */
#define LL_LPDMA2_TRIGGER_RTC_ALRA_TRG     13U /*!< LPDMA2 HW Trigger is RTC_ALRA_TRG    */
#define LL_LPDMA2_TRIGGER_RTC_ALRB_TRG     14U /*!< LPDMA2 HW Trigger is RTC_ALRB_TRG    */
#define LL_LPDMA2_TRIGGER_RTC_WUT_TRG      15U /*!< LPDMA2 HW Trigger is RTC_WUT_TRG     */
#define LL_LPDMA2_TRIGGER_TIM2_TRGO        16U /*!< LPDMA2 HW Trigger is TIM2_TRGO       */
#define LL_LPDMA2_TRIGGER_TIM15_TRGO       17U /*!< LPDMA2 HW Trigger is TIM15_TRGO      */
#define LL_LPDMA2_TRIGGER_COMP1_OUT        18U /*!< LPDMA2 HW Trigger is COMP1_OUT       */
#define LL_LPDMA2_TRIGGER_EVENTOUT         19U /*!< LPDMA2 HW Trigger is EVENTOUT        */
#define LL_LPDMA2_TRIGGER_LPDMA1_CH0_TC    20U /*!< LPDMA2 HW Trigger is LPDMA1_CH0_TC   */
#define LL_LPDMA2_TRIGGER_LPDMA1_CH1_TC    21U /*!< LPDMA2 HW Trigger is LPDMA1_CH1_TC   */
#define LL_LPDMA2_TRIGGER_LPDMA1_CH2_TC    22U /*!< LPDMA2 HW Trigger is LPDMA1_CH2_TC   */
#define LL_LPDMA2_TRIGGER_LPDMA1_CH3_TC    23U /*!< LPDMA2 HW Trigger is LPDMA1_CH3_TC   */
#if defined (LPDMA1_CH4)
#define LL_LPDMA2_TRIGGER_LPDMA1_CH4_TC    24U /*!< LPDMA2 HW Trigger is LPDMA1_CH4_TC   */
#endif /* LPDMA1_CH4 */
#if defined (LPDMA1_CH5)
#define LL_LPDMA2_TRIGGER_LPDMA1_CH5_TC    25U /*!< LPDMA2 HW Trigger is LPDMA1_CH5_TC   */
#endif /* LPDMA1_CH5 */
#if defined (LPDMA1_CH6)
#define LL_LPDMA2_TRIGGER_LPDMA1_CH6_TC    26U /*!< LPDMA2 HW Trigger is LPDMA1_CH6_TC   */
#endif /* LPDMA1_CH6 */
#if defined (LPDMA1_CH7)
#define LL_LPDMA2_TRIGGER_LPDMA1_CH7_TC    27U /*!< LPDMA2 HW Trigger is LPDMA1_CH7_TC   */
#endif /* LPDMA1_CH7 */
#define LL_LPDMA2_TRIGGER_LPDMA2_CH0_TC    28U /*!< LPDMA2 HW Trigger is LPDMA2_CH0_TC   */
#define LL_LPDMA2_TRIGGER_LPDMA2_CH1_TC    29U /*!< LPDMA2 HW Trigger is LPDMA2_CH1_TC   */
#define LL_LPDMA2_TRIGGER_LPDMA2_CH2_TC    30U /*!< LPDMA2 HW Trigger is LPDMA2_CH2_TC   */
#define LL_LPDMA2_TRIGGER_LPDMA2_CH3_TC    31U /*!< LPDMA2 HW Trigger is LPDMA2_CH3_TC   */
#if defined (LPDMA2_CH4)
#define LL_LPDMA2_TRIGGER_LPDMA2_CH4_TC    32U /*!< LPDMA2 HW Trigger is LPDMA2_CH4_TC   */
#endif /* LPDMA2_CH4 */
#if defined (LPDMA2_CH5)
#define LL_LPDMA2_TRIGGER_LPDMA2_CH5_TC    33U /*!< LPDMA2 HW Trigger is LPDMA2_CH5_TC   */
#endif /* LPDMA2_CH5 */
#if defined (LPDMA2_CH6)
#define LL_LPDMA2_TRIGGER_LPDMA2_CH6_TC    34U /*!< LPDMA2 HW Trigger is LPDMA2_CH6_TC   */
#endif /* LPDMA2_CH6 */
#if defined (LPDMA2_CH7)
#define LL_LPDMA2_TRIGGER_LPDMA2_CH7_TC    35U /*!< LPDMA2 HW Trigger is LPDMA2_CH7_TC   */
#endif /* LPDMA2_CH7 */
#if defined(COMP2)
#define LL_LPDMA2_TRIGGER_COMP2_OUT        36U /*!< LPDMA2 HW Trigger is COMP2_OUT       */
#endif /* COMP2 */
#endif /* LPDMA2 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

