MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/** @defgroup DMA_LL_Exported_Macros LL DMA Macros
  * @{
  */

/** @defgroup DMA_LL_EM_COMMON_WRITE_READ_REGISTERS Common Write and Read Registers macros
  * @{
  */
/**
  * @brief  Write a value in DMA register.
  * @param  instance DMA Instance.
  * @param  reg      Register to be written.
  * @param  value    Value to be written in the register.
  */
#define LL_DMA_WRITE_REG(instance, reg, value) STM32_WRITE_REG(((instance)->reg), (value))

/**
  * @brief  Modify a value in DMA register.
  * @param  instance DMA Instance.
  * @param  reg      Register to be written.
  * @param  mask     Mask to be clearing.
  * @param  value    Value to be written in the register.
  */
#define LL_DMA_MODIFY_REG(instance, reg, mask, value) STM32_MODIFY_REG(((instance)->reg), (mask), (value))

/**
  * @brief  Read a value in DMA register.
  * @param  instance DMA Instance.
  * @param  reg      Register to be read.
  * @retval Register value.
  */
#define LL_DMA_READ_REG(instance, reg) STM32_READ_REG(instance->reg)
/**
  * @}
  */

/** @defgroup DMA_LL_EM_CONVERT_dmaxCHANNELy Convert dmaxChannely
  * @{
  */
/**
  * @brief  Convert dmax_CHy into dmax.
  * @param  channel_instance dmax_CHy.
  * @retval dmax.
  */
#if defined (LPDMA2)
#if defined (LPDMA1_CH7)
#define LL_DMA_GET_INSTANCE(channel_instance) \
  (((uint32_t)(channel_instance) > ((uint32_t)LPDMA1_CH7)) ?  LPDMA2 : LPDMA1)
#else
#define LL_DMA_GET_INSTANCE(channel_instance) \
  (((uint32_t)(channel_instance) > ((uint32_t)LPDMA1_CH3)) ?  LPDMA2 : LPDMA1)
#endif /* LPDMA1_CH7 */
#else
#define LL_DMA_GET_INSTANCE(channel_instance) LPDMA1
#endif /* LPDMA2 */

/**
  * @brief  Convert dmax_CHy into LL_DMA_CHANNEL_y.
  * @param  channel_instance dmax_CHy.
  * @retval LL_DMA_CHANNEL_y.
  */
#if defined (LPDMA2)
#if defined (LPDMA2_CH7)
#define LL_DMA_GET_CHANNEL_IDX(channel_instance) \
  (((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH3))  ? LL_DMA_CHANNEL_3  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH3))  ? LL_DMA_CHANNEL_3  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH4))  ? LL_DMA_CHANNEL_4  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH4))  ? LL_DMA_CHANNEL_4  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH5))  ? LL_DMA_CHANNEL_5  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH5))  ? LL_DMA_CHANNEL_5  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH6))  ? LL_DMA_CHANNEL_6  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH6))  ? LL_DMA_CHANNEL_6  : \
   LL_DMA_CHANNEL_7)
#elif defined (LPDMA1_CH7)
#define LL_DMA_GET_CHANNEL_IDX(channel_instance) \
  (((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH3))  ? LL_DMA_CHANNEL_3  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH3))  ? LL_DMA_CHANNEL_3  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH4))  ? LL_DMA_CHANNEL_4  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH5))  ? LL_DMA_CHANNEL_5  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH6))  ? LL_DMA_CHANNEL_6  : \
   LL_DMA_CHANNEL_7)
#else
#define LL_DMA_GET_CHANNEL_IDX(channel_instance) \
  (((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA2_CH2))  ? LL_DMA_CHANNEL_2  : \
   LL_DMA_CHANNEL_3)
#endif /* LPDMA2_CH7 */
#else
#define LL_DMA_GET_CHANNEL_IDX(channel_instance) \
  (((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH3))  ? LL_DMA_CHANNEL_3  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH4))  ? LL_DMA_CHANNEL_4  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH5))  ? LL_DMA_CHANNEL_5  : \
   ((uint32_t)(channel_instance) == ((uint32_t)LPDMA1_CH6))  ? LL_DMA_CHANNEL_6  : \
   LL_DMA_CHANNEL_7)
#endif /* LPDMA2 */

/**
  * @brief  Convert DMA Instance dmax and LL_DMA_CHANNEL_y into dmax_CHy.
  * @param  dma_instance dmax.
  * @param  channel      LL_DMA_CHANNEL_y.
  * @retval dmax_CHy.
  */
#if defined (LPDMA2)
#if defined (LPDMA2_CH7)
#define LL_DMA_GET_CHANNEL_INSTANCE(dma_instance, channel) \
  ((((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_0))) \
   ? LPDMA1_CH0  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_0))) \
   ? LPDMA2_CH0  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_1))) \
   ? LPDMA1_CH1  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_1))) \
   ? LPDMA2_CH1  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_2))) \
   ? LPDMA1_CH2  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_2))) \
   ? LPDMA2_CH2  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_3))) \
   ? LPDMA1_CH3  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_3))) \
   ? LPDMA2_CH3  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_4))) \
   ? LPDMA1_CH4  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_4))) \
   ? LPDMA2_CH4  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_5))) \
   ? LPDMA1_CH5  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_5))) \
   ? LPDMA2_CH5  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_6))) \
   ? LPDMA1_CH6  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_6))) \
   ? LPDMA2_CH6  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_7))) \
   ? LPDMA1_CH7 :  LPDMA2_CH7)
#elif defined (LPDMA1_CH7)
#define LL_DMA_GET_CHANNEL_INSTANCE(dma_instance, channel) \
  ((((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_0))) \
   ? LPDMA1_CH0  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_0))) \
   ? LPDMA2_CH0  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_1))) \
   ? LPDMA1_CH1  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_1))) \
   ? LPDMA2_CH1  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_2))) \
   ? LPDMA1_CH2  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_2))) \
   ? LPDMA2_CH2  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_3))) \
   ? LPDMA1_CH3  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_3))) \
   ? LPDMA2_CH3  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_4))) \
   ? LPDMA1_CH4  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_5))) \
   ? LPDMA1_CH5  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_6))) \
   ? LPDMA1_CH6 :  LPDMA1_CH7)
#else
#define LL_DMA_GET_CHANNEL_INSTANCE(dma_instance, channel) \
  ((((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_0))) \
   ? LPDMA1_CH0  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_0))) \
   ? LPDMA2_CH0  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_1))) \
   ? LPDMA1_CH1  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_1))) \
   ? LPDMA2_CH1  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_2))) \
   ? LPDMA1_CH2  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA2)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_2))) \
   ? LPDMA2_CH2  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_3))) \
   ? LPDMA1_CH3 :  LPDMA2_CH3)
#endif /* LPDMA1_CH7 */
#else
#define LL_DMA_GET_CHANNEL_INSTANCE(dma_instance, channel) \
  ((((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_0))) \
   ? LPDMA1_CH0  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_1))) \
   ? LPDMA1_CH1  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_2))) \
   ? LPDMA1_CH2  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_3))) \
   ? LPDMA1_CH3  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_4))) \
   ? LPDMA1_CH4  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_5))) \
   ? LPDMA1_CH5  :                                                                                             \
   (((uint32_t)(dma_instance) == ((uint32_t)LPDMA1)) && ((uint32_t)(channel) == ((uint32_t)LL_DMA_CHANNEL_6))) \
   ? LPDMA1_CH6 :  LPDMA1_CH7)
#endif /* LPDMA2 */

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

