MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/**
  * @brief  Configure transfer.
  * @rmtoll
  *  CTR1          DINC          LL_DMA_ConfigTransfer \n
  *  CTR1          SINC          LL_DMA_ConfigTransfer \n
  *  CTR1          PAM           LL_DMA_ConfigTransfer
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_DMA_DEST_ADDR_FIXED          or @ref LL_DMA_DEST_ADDR_INCREMENTED
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_BYTE     or @ref LL_DMA_DEST_DATA_WIDTH_HALFWORD or
  *              @ref LL_DMA_DEST_DATA_WIDTH_WORD
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO or @ref LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN
  *         @arg @ref LL_DMA_SRC_ADDR_FIXED           or @ref LL_DMA_SRC_ADDR_INCREMENTED
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_BYTE      or @ref LL_DMA_SRC_DATA_WIDTH_HALFWORD  or
  *              @ref LL_DMA_SRC_DATA_WIDTH_WORD
  */
__STATIC_INLINE void LL_DMA_ConfigTransfer(DMA_Channel_TypeDef *channel, uint32_t configuration)
{
  STM32_MODIFY_REG(channel->CTR1,
                   DMA_CTR1_DINC | DMA_CTR1_SINC | DMA_CTR1_PAM | DMA_CTR1_DDW_LOG2 | DMA_CTR1_SDW_LOG2,
                   configuration);
}

/**
  * @brief  Configure data transfer.
  * @rmtoll
  *  CTR1          DINC          LL_DMA_ConfigDataTransfer \n
  *  CTR1          SINC          LL_DMA_ConfigDataTransfer \n
  *  CTR1          SDW_LOG2      LL_DMA_ConfigDataTransfer \n
  *  CTR1          DDW_LOG2      LL_DMA_ConfigDataTransfer
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_DMA_DEST_ADDR_FIXED
              or @ref LL_DMA_DEST_ADDR_INCREMENTED
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_BYTE
              or @ref LL_DMA_DEST_DATA_WIDTH_HALFWORD
              or @ref LL_DMA_DEST_DATA_WIDTH_WORD
  *         @arg @ref LL_DMA_SRC_ADDR_FIXED
              or @ref LL_DMA_SRC_ADDR_INCREMENTED
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_BYTE
              or @ref LL_DMA_SRC_DATA_WIDTH_HALFWORD
              or @ref LL_DMA_SRC_DATA_WIDTH_WORD
  */
__STATIC_INLINE void LL_DMA_ConfigDataTransfer(DMA_Channel_TypeDef *channel, uint32_t configuration)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_DINC | DMA_CTR1_SINC | DMA_CTR1_DDW_LOG2 | DMA_CTR1_SDW_LOG2, configuration);
}

/**
  * @brief  Configure data handling.
  * @rmtoll
  *  CTR1          PAM           LL_DMA_ConfigDataHandling
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO or @ref LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN
  */
__STATIC_INLINE void LL_DMA_ConfigDataHandling(DMA_Channel_TypeDef *channel, uint32_t configuration)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_PAM, configuration);
}

/**
  * @brief  Set destination increment mode.
  * @rmtoll
  *  CTR1          DINC           LL_DMA_SetDestIncMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  dest_inc This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DEST_ADDR_FIXED
  *         @arg @ref LL_DMA_DEST_ADDR_INCREMENTED
  */
__STATIC_INLINE void LL_DMA_SetDestIncMode(DMA_Channel_TypeDef *channel, uint32_t dest_inc)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_DINC, dest_inc);
}

/**
  * @brief  Get destination increment mode.
  * @rmtoll
  *  CTR1          DINC           LL_DMA_GetDestIncMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DEST_ADDR_FIXED
  *         @arg @ref LL_DMA_DEST_ADDR_INCREMENTED
  */
__STATIC_INLINE uint32_t LL_DMA_GetDestIncMode(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR1, DMA_CTR1_DINC));
}

/**
  * @brief  Set destination data width.
  * @rmtoll
  *  CTR1          DDW_LOG2           LL_DMA_SetDestDataWidth
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  dest_data_width This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_BYTE
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_WORD
  */
__STATIC_INLINE void LL_DMA_SetDestDataWidth(DMA_Channel_TypeDef *channel, uint32_t dest_data_width)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_DDW_LOG2, dest_data_width);
}

/**
  * @brief  Get destination data width.
  * @rmtoll
  *  CTR1          DDW_LOG2           LL_DMA_GetDestDataWidth
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_BYTE
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_DEST_DATA_WIDTH_WORD
  */
__STATIC_INLINE uint32_t LL_DMA_GetDestDataWidth(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR1, DMA_CTR1_DDW_LOG2));
}

/**
  * @brief  Set DMA channel destination data truncation and padding.
  * @rmtoll
  *  CTR1          PAM           LL_DMA_SetDataTruncPadd
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  data_trunc_padd This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN
  */
__STATIC_INLINE void LL_DMA_SetDataTruncPadd(DMA_Channel_TypeDef *channel, uint32_t data_trunc_padd)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_PAM_0, data_trunc_padd);
}

/**
  * @brief  Get DMA channel destination data truncation and padding.
  * @rmtoll
  *  CTR1          PAM           LL_DMA_GetDataTruncPadd
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN
  */
__STATIC_INLINE uint32_t LL_DMA_GetDataTruncPadd(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR1, DMA_CTR1_PAM_0));
}

/**
  * @brief  Set data alignment mode.
  * @rmtoll
  *  CTR1          PAM           LL_DMA_SetDataAlignment
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  data_alignment This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN
  */
__STATIC_INLINE void LL_DMA_SetDataAlignment(DMA_Channel_TypeDef *channel, uint32_t data_alignment)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_PAM, data_alignment);
}

/**
  * @brief  Get data alignment mode.
  * @rmtoll
  *  CTR1          PAM           LL_DMA_GetDataAlignment
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO
  *         @arg @ref LL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN
  */
__STATIC_INLINE uint32_t LL_DMA_GetDataAlignment(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR1, DMA_CTR1_PAM));
}

/**
  * @brief  Set source increment mode.
  * @rmtoll
  *  CTR1          SINC           LL_DMA_SetSrcIncMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  src_inc This parameter can be one of the following values:
  *         @arg @ref LL_DMA_SRC_ADDR_FIXED
  *         @arg @ref LL_DMA_SRC_ADDR_INCREMENTED
  */
__STATIC_INLINE void LL_DMA_SetSrcIncMode(DMA_Channel_TypeDef *channel, uint32_t src_inc)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_SINC, src_inc);
}

/**
  * @brief  Get source increment mode.
  * @rmtoll
  *  CTR1          SINC           LL_DMA_GetSrcIncMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_SRC_ADDR_FIXED
  *         @arg @ref LL_DMA_SRC_ADDR_INCREMENTED
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcIncMode(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR1, DMA_CTR1_SINC));
}

