MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/**
  * @brief  Set source data width.
  * @rmtoll
  *  CTR1          SDW_LOG2           LL_DMA_SetSrcDataWidth
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  src_data_width This parameter can be one of the following values:
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_BYTE
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_WORD
  */
__STATIC_INLINE void LL_DMA_SetSrcDataWidth(DMA_Channel_TypeDef *channel, uint32_t src_data_width)
{
  STM32_MODIFY_REG(channel->CTR1, DMA_CTR1_SDW_LOG2, src_data_width);
}

/**
  * @brief  Get Source Data width.
  * @rmtoll
  *  CTR1          SDW_LOG2           LL_DMA_GetSrcDataWidth
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_BYTE
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_HALFWORD
  *         @arg @ref LL_DMA_SRC_DATA_WIDTH_WORD
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcDataWidth(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR1, DMA_CTR1_SDW_LOG2));
}

/**
  * @brief  Configure channel transfer.
  * @rmtoll
  *  CTR2        TCEM               LL_DMA_ConfigChannelTransfer \n
  *  CTR2        TRIGPOL            LL_DMA_ConfigChannelTransfer \n
  *  CTR2        TRIGM              LL_DMA_ConfigChannelTransfer \n
  *  CTR2        BREQ               LL_DMA_ConfigChannelTransfer \n
  *  CTR2        SWREQ              LL_DMA_ConfigChannelTransfer
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_DMA_DIRECT_XFER_EVENT_BLOCK           or @ref LL_DMA_LINKEDLIST_XFER_EVENT_BLOCK
  *              @ref LL_DMA_LINKEDLIST_XFER_EVENT_NODE        or @ref LL_DMA_LINKEDLIST_XFER_EVENT_Q
  *         @arg @ref LL_DMA_HARDWARE_REQUEST_BURST            or @ref LL_DMA_HARDWARE_REQUEST_BLOCK
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_MASKED           or @ref LL_DMA_TRIGGER_POLARITY_RISING         or
  *              @ref LL_DMA_TRIGGER_POLARITY_FALLING
  *         @arg @ref LL_DMA_TRIGGER_BLOCK_TRANSFER            or @ref LL_DMA_TRIGGER_NODE_TRANSFER           or
  *              @ref LL_DMA_TRIGGER_SINGLE_BURST_TRANSFER
  *         @arg @ref LL_DMA_DIRECTION_PERIPH_TO_MEMORY        or @ref LL_DMA_DIRECTION_MEMORY_TO_PERIPH      or
  *              @ref LL_DMA_DIRECTION_MEMORY_TO_MEMORY
  */
__STATIC_INLINE void LL_DMA_ConfigChannelTransfer(DMA_Channel_TypeDef *channel, uint32_t configuration)
{
  STM32_MODIFY_REG(channel->CTR2, (DMA_CTR2_TCEM | DMA_CTR2_TRIGPOL | DMA_CTR2_TRIGM | DMA_CTR2_SWREQ | \
                                   DMA_CTR2_BREQ), configuration);
}

/**
  * @brief  Set transfer event mode.
  * @rmtoll
  *  CTR2          TCEM           LL_DMA_SetTransferEventMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  transfer_event_mode This parameter can be one of the following values:
  *         @arg @ref LL_DMA_DIRECT_XFER_EVENT_BLOCK
  *         @arg @ref LL_DMA_LINKEDLIST_XFER_EVENT_NODE
  *         @arg @ref LL_DMA_LINKEDLIST_XFER_EVENT_Q
  */
__STATIC_INLINE void LL_DMA_SetTransferEventMode(DMA_Channel_TypeDef *channel, uint32_t transfer_event_mode)
{
  STM32_MODIFY_REG(channel->CTR2, DMA_CTR2_TCEM, transfer_event_mode);
}

/**
  * @brief  Get transfer event mode.
  * @rmtoll
  *  CTR2          TCEM           LL_DMA_GetTransferEventMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_DIRECT_XFER_EVENT_BLOCK
  *         @arg @ref LL_DMA_LINKEDLIST_XFER_EVENT_NODE
  *         @arg @ref LL_DMA_LINKEDLIST_XFER_EVENT_Q
  */
__STATIC_INLINE uint32_t LL_DMA_GetTransferEventMode(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR2, DMA_CTR2_TCEM));
}

/**
  * @brief  Set trigger polarity.
  * @rmtoll
  *  CTR2          TRIGPOL            LL_DMA_ConfigChannelTrigger \n
  *  CTR2          TRIGM              LL_DMA_ConfigChannelTrigger \n
  *  CTR2          TRIGSEL            LL_DMA_ConfigChannelTrigger
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  trigger_selection This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI0
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI1
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI2
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI3
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI4
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI5
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI6
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI7
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG3
  * @if LPTIM1
  *         @arg @ref LL_LPDMA1_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_LPDMA1_TRIGGER_LPTIM1_CH2
  * @endif
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_LPDMA1_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP1_OUT
  *         @arg @ref LL_LPDMA1_TRIGGER_EVENTOUT
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH0_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH1_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH2_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH3_TC
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH4_TC
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH5_TC
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH6_TC
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH7_TC
  * @endif
  * @if LPDMA2
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH0_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH1_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH2_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH3_TC
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH4_TC
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH5_TC
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH6_TC
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH7_TC
  * @endif
  * @endif
  * @if COMP2
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP2_OUT
  * @endif
  * @if COMP3
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP3_OUT
  * @endif
  * @if COMP4
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP4_OUT
  * @endif
  * @if PLAY1
  *         @arg @ref LL_LPDMA1_TRIGGER_PLAY_OUT3
  * @endif
  * @if LPDMA2
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI0
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI1
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI2
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI3
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI4
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI5
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI6
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI7
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG3
  * @if LPTIM1
  *         @arg @ref LL_LPDMA2_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_LPDMA2_TRIGGER_LPTIM1_CH2
  * @endif
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_LPDMA2_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP1_OUT
  *         @arg @ref LL_LPDMA2_TRIGGER_EVENTOUT
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH0_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH1_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH2_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH3_TC
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH4_TC
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH5_TC
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH6_TC
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH7_TC
  * @endif
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH0_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH1_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH2_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH3_TC
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH4_TC
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH5_TC
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH6_TC
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH7_TC
  * @endif
  * @if COMP2
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP2_OUT
  * @endif
  * @if COMP3
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP3_OUT
  * @endif
  * @if COMP4
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP4_OUT
  * @endif
  * @if PLAY1
  *         @arg @ref LL_LPDMA2_TRIGGER_PLAY_OUT15
  * @endif
  * @endif
  * @param  trigger_config This parameter must be a combination of all the following values:
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_MASKED
  *           or @ref LL_DMA_TRIGGER_POLARITY_RISING
  *           or @ref LL_DMA_TRIGGER_POLARITY_FALLING
  *         @arg @ref LL_DMA_TRIGGER_BLOCK_TRANSFER
  *           or @ref LL_DMA_TRIGGER_NODE_TRANSFER
  *           or @ref LL_DMA_TRIGGER_SINGLE_BURST_TRANSFER
  */
__STATIC_INLINE void LL_DMA_ConfigChannelTrigger(DMA_Channel_TypeDef *channel, uint32_t trigger_selection,
                                                 uint32_t trigger_config)
{
  STM32_MODIFY_REG(channel->CTR2, (DMA_CTR2_TRIGPOL | DMA_CTR2_TRIGM | DMA_CTR2_TRIGSEL),
                   (trigger_config | ((trigger_selection << DMA_CTR2_TRIGSEL_Pos) & DMA_CTR2_TRIGSEL)));
}

/**
  * @brief  Set trigger polarity.
  * @rmtoll
  *  CTR2          TRIGPOL            LL_DMA_SetTriggerPolarity
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  trigger_polarity This parameter can be one of the following values:
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_MASKED
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_RISING
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_FALLING
  */
__STATIC_INLINE void LL_DMA_SetTriggerPolarity(DMA_Channel_TypeDef *channel, uint32_t trigger_polarity)
{
  STM32_MODIFY_REG(channel->CTR2, DMA_CTR2_TRIGPOL, trigger_polarity);
}

/**
  * @brief  Get trigger polarity.
  * @rmtoll
  *  CTR2          TRIGPOL            LL_DMA_GetTriggerPolarity
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_MASKED
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_RISING
  *         @arg @ref LL_DMA_TRIGGER_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_DMA_GetTriggerPolarity(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR2, DMA_CTR2_TRIGPOL));
}

/**
  * @brief  Set trigger Mode.
  * @rmtoll
  *  CTR2          TRIGM            LL_DMA_SetTriggerMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  trigger_mode This parameter can be one of the following values:
  *         @arg @ref LL_DMA_TRIGGER_BLOCK_TRANSFER
  *         @arg @ref LL_DMA_TRIGGER_NODE_TRANSFER
  *         @arg @ref LL_DMA_TRIGGER_SINGLE_BURST_TRANSFER
  */
__STATIC_INLINE void LL_DMA_SetTriggerMode(DMA_Channel_TypeDef *channel, uint32_t trigger_mode)
{
  STM32_MODIFY_REG(channel->CTR2, DMA_CTR2_TRIGM, trigger_mode);
}

/**
  * @brief  Get trigger Mode.
  * @rmtoll
  *  CTR2          TRIGM            LL_DMA_GetTriggerMode
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_DMA_TRIGGER_BLOCK_TRANSFER
  *         @arg @ref LL_DMA_TRIGGER_NODE_TRANSFER
  *         @arg @ref LL_DMA_TRIGGER_SINGLE_BURST_TRANSFER
  */
__STATIC_INLINE uint32_t LL_DMA_GetTriggerMode(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR2, DMA_CTR2_TRIGM));
}

