MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/**
  * @brief  Get hardware request.
  * @rmtoll
  *  CTR2         REQSEL     LL_DMA_GetPeriphRequest
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPDMA1_REQUEST_ADC1
  * @if ADC2
  *         @arg @ref LL_LPDMA1_REQUEST_ADC2
  * @endif
  *         @arg @ref LL_LPDMA1_REQUEST_TIM6_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM7_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_SPI1_RX
  *         @arg @ref LL_LPDMA1_REQUEST_SPI1_TX
  *         @arg @ref LL_LPDMA1_REQUEST_SPI2_RX
  *         @arg @ref LL_LPDMA1_REQUEST_SPI2_TX
  * @if SPI3
  *         @arg @ref LL_LPDMA1_REQUEST_SPI3_RX
  *         @arg @ref LL_LPDMA1_REQUEST_SPI3_TX
  * @endif
  *         @arg @ref LL_LPDMA1_REQUEST_I2C1_RX
  *         @arg @ref LL_LPDMA1_REQUEST_I2C1_TX
  *         @arg @ref LL_LPDMA1_REQUEST_USART1_RX
  *         @arg @ref LL_LPDMA1_REQUEST_USART1_TX
  *         @arg @ref LL_LPDMA1_REQUEST_USART2_RX
  *         @arg @ref LL_LPDMA1_REQUEST_USART2_TX
  * @if USART3
  *         @arg @ref LL_LPDMA1_REQUEST_USART3_RX
  *         @arg @ref LL_LPDMA1_REQUEST_USART3_TX
  * @endif
  *         @arg @ref LL_LPDMA1_REQUEST_UART4_RX
  *         @arg @ref LL_LPDMA1_REQUEST_UART4_TX
  *         @arg @ref LL_LPDMA1_REQUEST_UART5_RX
  *         @arg @ref LL_LPDMA1_REQUEST_UART5_TX
  *         @arg @ref LL_LPDMA1_REQUEST_LPUART1_RX
  *         @arg @ref LL_LPDMA1_REQUEST_LPUART1_TX
  *         @arg @ref LL_LPDMA1_REQUEST_TIM1_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM1_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM1_CC3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM1_CC4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM1_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM1_TRGI
  *         @arg @ref LL_LPDMA1_REQUEST_TIM1_COM
  *         @arg @ref LL_LPDMA1_REQUEST_TIM2_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM2_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM2_CC3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM2_CC4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM2_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM2_TRGI
  * @if TIM5
  *         @arg @ref LL_LPDMA1_REQUEST_TIM5_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM5_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM5_CC3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM5_CC4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM5_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM5_TRGI
  * @endif
  *         @arg @ref LL_LPDMA1_REQUEST_TIM15_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM15_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM15_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM15_TRGI
  *         @arg @ref LL_LPDMA1_REQUEST_TIM15_COM
  * @if TIM16
  *         @arg @ref LL_LPDMA1_REQUEST_TIM16_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM16_UPD
  * @endif
  * @if TIM17
  *         @arg @ref LL_LPDMA1_REQUEST_TIM17_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM17_UPD
  * @endif
  * @if LPTIM1
  *         @arg @ref LL_LPDMA1_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_LPDMA1_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_LPDMA1_REQUEST_LPTIM1_UE
  * @endif
  *         @arg @ref LL_LPDMA1_REQUEST_CORDIC_RD
  *         @arg @ref LL_LPDMA1_REQUEST_CORDIC_WR
  *         @arg @ref LL_LPDMA1_REQUEST_I3C1_RX
  *         @arg @ref LL_LPDMA1_REQUEST_I3C1_TX
  *         @arg @ref LL_LPDMA1_REQUEST_I3C1_TC
  *         @arg @ref LL_LPDMA1_REQUEST_I3C1_RS
  *         @arg @ref LL_LPDMA1_REQUEST_AES_OUT
  *         @arg @ref LL_LPDMA1_REQUEST_AES_IN
  *         @arg @ref LL_LPDMA1_REQUEST_HASH_IN
  * @if I2C2
  *         @arg @ref LL_LPDMA1_REQUEST_I2C2_RX
  *         @arg @ref LL_LPDMA1_REQUEST_I2C2_TX
  * @endif
  *         @arg @ref LL_LPDMA1_REQUEST_TIM8_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM8_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM8_CC3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM8_CC4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM8_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM8_TRGI
  *         @arg @ref LL_LPDMA1_REQUEST_TIM8_COM
  *         @arg @ref LL_LPDMA1_REQUEST_DAC1_CH1
  * @if (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
  *         @arg @ref LL_LPDMA1_REQUEST_DAC1_CH2
  * @endif
  * @if USART6
  *         @arg @ref LL_LPDMA1_REQUEST_USART6_RX
  *         @arg @ref LL_LPDMA1_REQUEST_USART6_TX
  * @endif
  * @if UART7
  *         @arg @ref LL_LPDMA1_REQUEST_UART7_TX
  *         @arg @ref LL_LPDMA1_REQUEST_UART7_RX
  * @endif
  * @if ADC3
  *         @arg @ref LL_LPDMA1_REQUEST_ADC3
  * @endif
  * @if TIM3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM3_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM3_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM3_CC3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM3_CC4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM3_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM3_TRGI
  * @endif
  * @if TIM4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM4_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM4_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM4_CC3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM4_CC4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM4_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM4_TRGI
  * @endif
  * @if SAES
  *         @arg @ref LL_LPDMA1_REQUEST_SAES_OUT
  *         @arg @ref LL_LPDMA1_REQUEST_SAES_IN
  * @endif
  * @if XSPI1
  *         @arg @ref LL_LPDMA1_REQUEST_XSPI1
  * @endif
  * @if TIM20
  *         @arg @ref LL_LPDMA1_REQUEST_TIM20_CC1
  *         @arg @ref LL_LPDMA1_REQUEST_TIM20_CC2
  *         @arg @ref LL_LPDMA1_REQUEST_TIM20_CC3
  *         @arg @ref LL_LPDMA1_REQUEST_TIM20_CC4
  *         @arg @ref LL_LPDMA1_REQUEST_TIM20_UPD
  *         @arg @ref LL_LPDMA1_REQUEST_TIM20_TRGI
  *         @arg @ref LL_LPDMA1_REQUEST_TIM20_COM
  * @endif
  * @if DAC2
  *         @arg @ref LL_LPDMA1_REQUEST_DAC2_CH1
  * @if (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
  *         @arg @ref LL_LPDMA1_REQUEST_DAC2_CH2
  * @endif
  * @endif
  * @if LPDMA2
  *         @arg @ref LL_LPDMA2_REQUEST_ADC1
  * @if ADC2
  *         @arg @ref LL_LPDMA2_REQUEST_ADC2
  * @endif
  *         @arg @ref LL_LPDMA2_REQUEST_TIM6_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM7_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_SPI1_RX
  *         @arg @ref LL_LPDMA2_REQUEST_SPI1_TX
  *         @arg @ref LL_LPDMA2_REQUEST_SPI2_RX
  *         @arg @ref LL_LPDMA2_REQUEST_SPI2_TX
  * @if SPI3
  *         @arg @ref LL_LPDMA2_REQUEST_SPI3_RX
  *         @arg @ref LL_LPDMA2_REQUEST_SPI3_TX
  * @endif
  *         @arg @ref LL_LPDMA2_REQUEST_I2C1_RX
  *         @arg @ref LL_LPDMA2_REQUEST_I2C1_TX
  *         @arg @ref LL_LPDMA2_REQUEST_USART1_RX
  *         @arg @ref LL_LPDMA2_REQUEST_USART1_TX
  *         @arg @ref LL_LPDMA2_REQUEST_USART2_RX
  *         @arg @ref LL_LPDMA2_REQUEST_USART2_TX
  * @if USART3
  *         @arg @ref LL_LPDMA2_REQUEST_USART3_RX
  *         @arg @ref LL_LPDMA2_REQUEST_USART3_TX
  * @endif
  *         @arg @ref LL_LPDMA2_REQUEST_UART4_RX
  *         @arg @ref LL_LPDMA2_REQUEST_UART4_TX
  *         @arg @ref LL_LPDMA2_REQUEST_UART5_RX
  *         @arg @ref LL_LPDMA2_REQUEST_UART5_TX
  *         @arg @ref LL_LPDMA2_REQUEST_LPUART1_RX
  *         @arg @ref LL_LPDMA2_REQUEST_LPUART1_TX
  *         @arg @ref LL_LPDMA2_REQUEST_TIM1_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM1_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM1_CC3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM1_CC4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM1_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM1_TRGI
  *         @arg @ref LL_LPDMA2_REQUEST_TIM1_COM
  *         @arg @ref LL_LPDMA2_REQUEST_TIM2_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM2_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM2_CC3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM2_CC4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM2_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM2_TRGI
  * @if TIM5
  *         @arg @ref LL_LPDMA2_REQUEST_TIM5_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM5_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM5_CC3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM5_CC4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM5_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM5_TRGI
  * @endif
  *         @arg @ref LL_LPDMA2_REQUEST_TIM15_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM15_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM15_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM15_TRGI
  *         @arg @ref LL_LPDMA2_REQUEST_TIM15_COM
  * @if TIM16
  *         @arg @ref LL_LPDMA2_REQUEST_TIM16_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM16_UPD
  * @endif
  * @if TIM17
  *         @arg @ref LL_LPDMA2_REQUEST_TIM17_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM17_UPD
  * @endif
  * @if LPTIM1
  *         @arg @ref LL_LPDMA2_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_LPDMA2_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_LPDMA2_REQUEST_LPTIM1_UE
  * @endif
  *         @arg @ref LL_LPDMA2_REQUEST_CORDIC_RD
  *         @arg @ref LL_LPDMA2_REQUEST_CORDIC_WR
  *         @arg @ref LL_LPDMA2_REQUEST_I3C1_RX
  *         @arg @ref LL_LPDMA2_REQUEST_I3C1_TX
  *         @arg @ref LL_LPDMA2_REQUEST_I3C1_TC
  *         @arg @ref LL_LPDMA2_REQUEST_I3C1_RS
  *         @arg @ref LL_LPDMA2_REQUEST_AES_OUT
  *         @arg @ref LL_LPDMA2_REQUEST_AES_IN
  *         @arg @ref LL_LPDMA2_REQUEST_HASH_IN
  * @if I2C2
  *         @arg @ref LL_LPDMA2_REQUEST_I2C2_RX
  *         @arg @ref LL_LPDMA2_REQUEST_I2C2_TX
  * @endif
  *         @arg @ref LL_LPDMA2_REQUEST_TIM8_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM8_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM8_CC3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM8_CC4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM8_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM8_TRGI
  *         @arg @ref LL_LPDMA2_REQUEST_TIM8_COM
  *         @arg @ref LL_LPDMA2_REQUEST_DAC1_CH1
  * @if (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
  *         @arg @ref LL_LPDMA2_REQUEST_DAC1_CH2
  * @endif
  * @if USART6
  *         @arg @ref LL_LPDMA2_REQUEST_USART6_RX
  *         @arg @ref LL_LPDMA2_REQUEST_USART6_TX
  * @endif
  * @if UART7
  *         @arg @ref LL_LPDMA2_REQUEST_UART7_TX
  *         @arg @ref LL_LPDMA2_REQUEST_UART7_RX
  * @endif
  * @if ADC3
  *         @arg @ref LL_LPDMA2_REQUEST_ADC3
  * @endif
  * @if TIM3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM3_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM3_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM3_CC3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM3_CC4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM3_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM3_TRGI
  * @endif
  * @if TIM4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM4_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM4_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM4_CC3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM4_CC4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM4_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM4_TRGI
  * @endif
  * @if SAES
  *         @arg @ref LL_LPDMA2_REQUEST_SAES_OUT
  *         @arg @ref LL_LPDMA2_REQUEST_SAES_IN
  * @endif
  * @if XSPI1
  *         @arg @ref LL_LPDMA2_REQUEST_XSPI1
  * @endif
  * @if TIM20
  *         @arg @ref LL_LPDMA2_REQUEST_TIM20_CC1
  *         @arg @ref LL_LPDMA2_REQUEST_TIM20_CC2
  *         @arg @ref LL_LPDMA2_REQUEST_TIM20_CC3
  *         @arg @ref LL_LPDMA2_REQUEST_TIM20_CC4
  *         @arg @ref LL_LPDMA2_REQUEST_TIM20_UPD
  *         @arg @ref LL_LPDMA2_REQUEST_TIM20_TRGI
  *         @arg @ref LL_LPDMA2_REQUEST_TIM20_COM
  * @endif
  * @if DAC2
  *         @arg @ref LL_LPDMA2_REQUEST_DAC2_CH1
  * @if (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2UL)
  *         @arg @ref LL_LPDMA2_REQUEST_DAC2_CH2
  * @endif
  * @endif
  * @endif
  */
__STATIC_INLINE uint32_t LL_DMA_GetPeriphRequest(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR2, DMA_CTR2_REQSEL));
}

/**
  * @brief  Set hardware trigger.
  * @rmtoll
  *  CTR2         TRIGSEL     LL_DMA_SetHWTrigger
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  trigger This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI0
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI1
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI2
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI3
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI4
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI5
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI6
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI7
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG3
  * @if LPTIM1
  *         @arg @ref LL_LPDMA1_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_LPDMA1_TRIGGER_LPTIM1_CH2
  * @endif
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_LPDMA1_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP1_OUT
  *         @arg @ref LL_LPDMA1_TRIGGER_EVENTOUT
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH0_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH1_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH2_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH3_TC
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH4_TC
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH5_TC
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH6_TC
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH7_TC
  * @endif
  * @if LPDMA2
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH0_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH1_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH2_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH3_TC
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH4_TC
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH5_TC
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH6_TC
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH7_TC
  * @endif
  * @endif
  * @if COMP2
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP2_OUT
  * @endif
  * @if COMP3
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP3_OUT
  * @endif
  * @if COMP4
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP4_OUT
  * @endif
  * @if PLAY1
  *         @arg @ref LL_LPDMA1_TRIGGER_PLAY_OUT3
  * @endif
  * @if LPDMA2
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI0
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI1
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI2
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI3
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI4
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI5
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI6
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI7
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG3
  * @if LPTIM1
  *         @arg @ref LL_LPDMA2_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_LPDMA2_TRIGGER_LPTIM1_CH2
  * @endif
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_LPDMA2_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP1_OUT
  *         @arg @ref LL_LPDMA2_TRIGGER_EVENTOUT
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH0_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH1_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH2_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH3_TC
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH4_TC
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH5_TC
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH6_TC
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH7_TC
  * @endif
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH0_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH1_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH2_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH3_TC
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH4_TC
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH5_TC
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH6_TC
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH7_TC
  * @endif
  * @if COMP2
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP2_OUT
  * @endif
  * @if COMP3
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP3_OUT
  * @endif
  * @if COMP4
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP4_OUT
  * @endif
  * @if PLAY1
  *         @arg @ref LL_LPDMA2_TRIGGER_PLAY_OUT15
  * @endif
  * @endif
  */
__STATIC_INLINE void LL_DMA_SetHWTrigger(DMA_Channel_TypeDef *channel, uint32_t trigger)
{
  STM32_MODIFY_REG(channel->CTR2, DMA_CTR2_TRIGSEL, (trigger << DMA_CTR2_TRIGSEL_Pos) & DMA_CTR2_TRIGSEL);
}

