MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/**
  * @brief  Get hardware triggers.
  * @rmtoll
  *  CTR2         TRIGSEL     LL_DMA_GetHWTrigger
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI0
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI1
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI2
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI3
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI4
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI5
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI6
  *         @arg @ref LL_LPDMA1_TRIGGER_EXTI7
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_LPDMA1_TRIGGER_TAMP_TRG3
  * @if LPTIM1
  *         @arg @ref LL_LPDMA1_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_LPDMA1_TRIGGER_LPTIM1_CH2
  * @endif
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_LPDMA1_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_LPDMA1_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP1_OUT
  *         @arg @ref LL_LPDMA1_TRIGGER_EVENTOUT
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH0_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH1_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH2_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH3_TC
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH4_TC
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH5_TC
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH6_TC
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA1_CH7_TC
  * @endif
  * @if LPDMA2
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH0_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH1_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH2_TC
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH3_TC
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH4_TC
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH5_TC
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH6_TC
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA1_TRIGGER_LPDMA2_CH7_TC
  * @endif
  * @endif
  * @if COMP2
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP2_OUT
  * @endif
  * @if COMP3
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP3_OUT
  * @endif
  * @if COMP4
  *         @arg @ref LL_LPDMA1_TRIGGER_COMP4_OUT
  * @endif
  * @if PLAY1
  *         @arg @ref LL_LPDMA1_TRIGGER_PLAY_OUT3
  * @endif
  * @if LPDMA2
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI0
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI1
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI2
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI3
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI4
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI5
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI6
  *         @arg @ref LL_LPDMA2_TRIGGER_EXTI7
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_LPDMA2_TRIGGER_TAMP_TRG3
  * @if LPTIM1
  *         @arg @ref LL_LPDMA2_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_LPDMA2_TRIGGER_LPTIM1_CH2
  * @endif
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_LPDMA2_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_LPDMA2_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP1_OUT
  *         @arg @ref LL_LPDMA2_TRIGGER_EVENTOUT
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH0_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH1_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH2_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH3_TC
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH4_TC
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH5_TC
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH6_TC
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA1_CH7_TC
  * @endif
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH0_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH1_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH2_TC
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH3_TC
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH4_TC
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH5_TC
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH6_TC
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_TRIGGER_LPDMA2_CH7_TC
  * @endif
  * @if COMP2
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP2_OUT
  * @endif
  * @if COMP3
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP3_OUT
  * @endif
  * @if COMP4
  *         @arg @ref LL_LPDMA2_TRIGGER_COMP4_OUT
  * @endif
  * @if PLAY1
  *         @arg @ref LL_LPDMA2_TRIGGER_PLAY_OUT15
  * @endif
  * @endif
  */
__STATIC_INLINE  uint32_t LL_DMA_GetHWTrigger(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CTR2, DMA_CTR2_TRIGSEL) >> DMA_CTR2_TRIGSEL_Pos);
}

/**
  * @brief  Set block data length in bytes to transfer.
  * @rmtoll
  *  CBR1        BNDT         LL_DMA_SetBlkDataLength
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  blk_data_length Between 0 and 0x0000FFFF
  */
__STATIC_INLINE void LL_DMA_SetBlkDataLength(DMA_Channel_TypeDef *channel, uint32_t blk_data_length)
{
  STM32_MODIFY_REG(channel->CBR1, DMA_CBR1_BNDT, blk_data_length);
}

/**
  * @brief  Get block data length in bytes to transfer.
  * @rmtoll
  *  CBR1        BNDT         LL_DMA_GetBlkDataLength
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Between 0 and 0x0000FFFF
  */
__STATIC_INLINE uint32_t LL_DMA_GetBlkDataLength(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_BIT(channel->CBR1, DMA_CBR1_BNDT));
}

/**
  * @brief  Configure the source and destination addresses.
  * @rmtoll
  *  CSAR        SA          LL_DMA_ConfigAddresses \n
  *  CDAR        DA          LL_DMA_ConfigAddresses
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  src_address Between 0 and 0xFFFFFFFF
  * @param  dest_address Between 0 and 0xFFFFFFFF
  * @warning This API must not be called when the DMA channel is enabled.
  */
__STATIC_INLINE void LL_DMA_ConfigAddresses(DMA_Channel_TypeDef *channel, uint32_t src_address, uint32_t dest_address)
{
  STM32_WRITE_REG(channel->CSAR, src_address);
  STM32_WRITE_REG(channel->CDAR, dest_address);
}

/**
  * @brief  Set source address.
  * @rmtoll
  *  CSAR        SA         LL_DMA_SetSrcAddress
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  src_address Between 0 and 0xFFFFFFFF
  */
__STATIC_INLINE void LL_DMA_SetSrcAddress(DMA_Channel_TypeDef *channel, uint32_t src_address)
{
  STM32_WRITE_REG(channel->CSAR, src_address);
}

/**
  * @brief  Get source address.
  * @rmtoll
  *  CSAR        SA         LL_DMA_GetSrcAddress
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Between 0 and 0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_DMA_GetSrcAddress(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_REG(channel->CSAR));
}

/**
  * @brief  Set destination address.
  * @rmtoll
  *  CDAR        DA         LL_DMA_SetDestAddress
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  dest_address Between 0 and 0xFFFFFFFF
  */
__STATIC_INLINE void LL_DMA_SetDestAddress(DMA_Channel_TypeDef *channel, uint32_t dest_address)
{
  STM32_WRITE_REG(channel->CDAR, dest_address);
}

/**
  * @brief  Get destination address.
  * @rmtoll
  *  CDAR        DA         LL_DMA_GetDestAddress
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval Between 0 and 0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_DMA_GetDestAddress(const DMA_Channel_TypeDef *channel)
{
  return (STM32_READ_REG(channel->CDAR));
}

/**
  * @brief  Configure registers update and node address offset during the link transfer.
  * @rmtoll
  *  CLLR          UT1            LL_DMA_ConfigLinkUpdate \n
  *  CLLR          UT2            LL_DMA_ConfigLinkUpdate \n
  *  CLLR          UB1            LL_DMA_ConfigLinkUpdate \n
  *  CLLR          USA            LL_DMA_ConfigLinkUpdate \n
  *  CLLR          UDA            LL_DMA_ConfigLinkUpdate \n
  *  CLLR          ULL            LL_DMA_ConfigLinkUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @param  registers_update This parameter must be a combination of all the following values:
  *         @arg @ref LL_DMA_UPDATE_CTR1
  *         @arg @ref LL_DMA_UPDATE_CTR2
  *         @arg @ref LL_DMA_UPDATE_CBR1
  *         @arg @ref LL_DMA_UPDATE_CSAR
  *         @arg @ref LL_DMA_UPDATE_CDAR
  *         @arg @ref LL_DMA_UPDATE_CLLR
  * @param  linked_list_addr_offset Between 0 and 0x0000FFFC
  */
__STATIC_INLINE void LL_DMA_ConfigLinkUpdate(DMA_Channel_TypeDef *channel, uint32_t registers_update,
                                             uint32_t linked_list_addr_offset)
{
  STM32_MODIFY_REG(channel->CLLR,
                   (DMA_CLLR_UT1 | DMA_CLLR_UT2 | DMA_CLLR_UB1 | DMA_CLLR_USA | DMA_CLLR_UDA | DMA_CLLR_ULL | \
                    DMA_CLLR_LA),
                   (registers_update | (linked_list_addr_offset & DMA_CLLR_LA)));
}

/**
  * @brief  Enable CTR1 update during the link transfer.
  * @rmtoll
  *  CLLR          UT1            LL_DMA_EnableCTR1Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_EnableCTR1Update(DMA_Channel_TypeDef *channel)
{
  STM32_SET_BIT(channel->CLLR, DMA_CLLR_UT1);
}

/**
  * @brief  Disable CTR1 update during the link transfer.
  * @rmtoll
  *  CLLR          UT1            LL_DMA_DisableCTR1Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_DisableCTR1Update(DMA_Channel_TypeDef *channel)
{
  STM32_CLEAR_BIT(channel->CLLR, DMA_CLLR_UT1);
}

