MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_dma.h
/**
  * @brief  Check if CTR1 update during the link transfer is enabled.
  * @rmtoll
  *  CLLR          UT1            LL_DMA_IsEnabledCTR1Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledCTR1Update(const DMA_Channel_TypeDef *channel)
{
  return ((STM32_READ_BIT(channel->CLLR, DMA_CLLR_UT1) == (DMA_CLLR_UT1)) ? 1UL : 0UL);
}

/**
  * @brief  Enable CTR2 update during the link transfer.
  * @rmtoll
  *  CLLR          UT2            LL_DMA_EnableCTR2Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_EnableCTR2Update(DMA_Channel_TypeDef *channel)
{
  STM32_SET_BIT(channel->CLLR, DMA_CLLR_UT2);
}

/**
  * @brief  Disable CTR2 update during the link transfer.
  * @rmtoll
  *  CLLR          UT2            LL_DMA_DisableCTR2Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_DisableCTR2Update(DMA_Channel_TypeDef *channel)
{
  STM32_CLEAR_BIT(channel->CLLR, DMA_CLLR_UT2);
}

/**
  * @brief  Check if CTR2 update during the link transfer is enabled.
  * @rmtoll
  *  CLLR          UT2            LL_DMA_IsEnabledCTR2Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledCTR2Update(const DMA_Channel_TypeDef *channel)
{
  return ((STM32_READ_BIT(channel->CLLR, DMA_CLLR_UT2) == (DMA_CLLR_UT2)) ? 1UL : 0UL);
}

/**
  * @brief  Enable CBR1 update during the link transfer.
  * @rmtoll
  *  CLLR          UB1            LL_DMA_EnableCBR1Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_EnableCBR1Update(DMA_Channel_TypeDef *channel)
{
  STM32_SET_BIT(channel->CLLR, DMA_CLLR_UB1);
}

/**
  * @brief  Disable CBR1 update during the link transfer.
  * @rmtoll
  *  CLLR          UB1            LL_DMA_DisableCBR1Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_DisableCBR1Update(DMA_Channel_TypeDef *channel)
{
  STM32_CLEAR_BIT(channel->CLLR, DMA_CLLR_UB1);
}

/**
  * @brief  Check if CBR1 update during the link transfer is enabled.
  * @rmtoll
  *  CLLR          UB1            LL_DMA_IsEnabledCBR1Update
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledCBR1Update(const DMA_Channel_TypeDef *channel)
{
  return ((STM32_READ_BIT(channel->CLLR, DMA_CLLR_UB1) == (DMA_CLLR_UB1)) ? 1UL : 0UL);
}

/**
  * @brief  Enable CSAR update during the link transfer.
  * @rmtoll
  *  CLLR          USA            LL_DMA_EnableCSARUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_EnableCSARUpdate(DMA_Channel_TypeDef *channel)
{
  STM32_SET_BIT(channel->CLLR, DMA_CLLR_USA);
}

/**
  * @brief  Disable CSAR update during the link transfer.
  * @rmtoll
  *  CLLR          USA            LL_DMA_DisableCSARUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_DisableCSARUpdate(DMA_Channel_TypeDef *channel)
{
  STM32_CLEAR_BIT(channel->CLLR, DMA_CLLR_USA);
}

/**
  * @brief  Check if CSAR update during the link transfer is enabled.
  * @rmtoll
  *  CLLR          USA            LL_DMA_IsEnabledCSARUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledCSARUpdate(const DMA_Channel_TypeDef *channel)
{
  return ((STM32_READ_BIT(channel->CLLR, DMA_CLLR_USA) == (DMA_CLLR_USA)) ? 1UL : 0UL);
}

/**
  * @brief  Enable CDAR update during the link transfer.
  * @rmtoll
  *  CLLR          UDA            LL_DMA_EnableCDARUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_EnableCDARUpdate(DMA_Channel_TypeDef *channel)
{
  STM32_SET_BIT(channel->CLLR, DMA_CLLR_UDA);
}

/**
  * @brief  Disable CDAR update during the link transfer.
  * @rmtoll
  *  CLLR          UDA            LL_DMA_DisableCDARUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_DisableCDARUpdate(DMA_Channel_TypeDef *channel)
{
  STM32_CLEAR_BIT(channel->CLLR, DMA_CLLR_UDA);
}

/**
  * @brief  Check if CDAR update during the link transfer is enabled.
  * @rmtoll
  *  CLLR          UDA            LL_DMA_IsEnabledCDARUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledCDARUpdate(const DMA_Channel_TypeDef *channel)
{
  return ((STM32_READ_BIT(channel->CLLR, DMA_CLLR_UDA) == (DMA_CLLR_UDA)) ? 1UL : 0UL);
}

/**
  * @brief  Enable CLLR update during the link transfer.
  * @rmtoll
  *  CLLR          ULL            LL_DMA_EnableCLLRUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_EnableCLLRUpdate(DMA_Channel_TypeDef *channel)
{
  STM32_SET_BIT(channel->CLLR, DMA_CLLR_ULL);
}

/**
  * @brief  Disable CLLR update during the link transfer.
  * @rmtoll
  *  CLLR          ULL            LL_DMA_DisableCLLRUpdate
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPDMA1_CH0
  *         @arg @ref LL_LPDMA1_CH1
  *         @arg @ref LL_LPDMA1_CH2
  *         @arg @ref LL_LPDMA1_CH3
  * @if LPDMA1_CH4
  *         @arg @ref LL_LPDMA1_CH4 (*)
  * @endif
  * @if LPDMA1_CH5
  *         @arg @ref LL_LPDMA1_CH5 (*)
  * @endif
  * @if LPDMA1_CH6
  *         @arg @ref LL_LPDMA1_CH6 (*)
  * @endif
  * @if LPDMA1_CH7
  *         @arg @ref LL_LPDMA1_CH7 (*)
  * @endif
  * @if LPDMA2_CH0
  *         @arg @ref LL_LPDMA2_CH0 (*)
  * @endif
  * @if LPDMA2_CH1
  *         @arg @ref LL_LPDMA2_CH1 (*)
  * @endif
  * @if LPDMA2_CH2
  *         @arg @ref LL_LPDMA2_CH2 (*)
  * @endif
  * @if LPDMA2_CH3
  *         @arg @ref LL_LPDMA2_CH3 (*)
  * @endif
  * @if LPDMA2_CH4
  *         @arg @ref LL_LPDMA2_CH4 (*)
  * @endif
  * @if LPDMA2_CH5
  *         @arg @ref LL_LPDMA2_CH5 (*)
  * @endif
  * @if LPDMA2_CH6
  *         @arg @ref LL_LPDMA2_CH6 (*)
  * @endif
  * @if LPDMA2_CH7
  *         @arg @ref LL_LPDMA2_CH7 (*)
  * @endif
  *         @note (*) Availability depends on the selected device. \n
  *                   Please refer to the reference manual for more details.
  */
__STATIC_INLINE void LL_DMA_DisableCLLRUpdate(DMA_Channel_TypeDef *channel)
{
  STM32_CLEAR_BIT(channel->CLLR, DMA_CLLR_ULL);
}

